package example.com.demo;

import android.content.DialogInterface;
import android.content.Intent;
import android.os.Bundle;
import android.support.v7.app.AlertDialog;
import android.support.v7.app.AppCompatActivity;
import android.support.v7.widget.DefaultItemAnimator;
import android.support.v7.widget.LinearLayoutManager;
import android.support.v7.widget.RecyclerView;

import example.com.demo.adapter.Fort_Adapter;

public class FortInformation extends AppCompatActivity {

    RecyclerView recyclerView;
    Fort_Adapter fortAdapter;

    int[] fortImg;
    String[] fortName;
    String[] fortIntroduction;
    String[] fortHistory;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);

        try {
            recyclerView = (RecyclerView) findViewById(R.id.recycler_view_fort);
            LinearLayoutManager layoutManager = new LinearLayoutManager(FortInformation.this);
            recyclerView.setLayoutManager(layoutManager);
            recyclerView.setItemAnimator(new DefaultItemAnimator());
            recyclerView.setHasFixedSize(true);
        } catch (Exception e) {
            e.printStackTrace();
        }

        /** fort Images **/
        fortImg = new int[]{
                R.drawable.fort_raigad,
                R.drawable.fort_sudhagad,
                R.drawable.fort_rajgad,
                R.drawable.fort_dhodap,
                R.drawable.fort_hadsar,
                R.drawable.fort_moragad,
                R.drawable.fort_mahipatgad,
                R.drawable.fort_lohgad,
                R.drawable.fort_tung,
                R.drawable.fort_janjira,
                R.drawable.fort_dhakoba,
                R.drawable.fort_narnala,
                R.drawable.fort_bhiri,
                R.drawable.fort_gavilgad,
                R.drawable.fort_lingana,
                R.drawable.fort_vishramgad,
                R.drawable.fort_mulher,
                R.drawable.fort_varugad,
                R.drawable.fort_vasantgad,
                R.drawable.fort_mahimanga,
                R.drawable.fort_shingad,
                R.drawable.fort_madangad,
                R.drawable.fort_anjangad,
                R.drawable.fort_torna,
                R.drawable.fort_rohida,
                R.drawable.fort_purandar,
                R.drawable.fort_bhuargad,
                R.drawable.fort_visapur,
                R.drawable.fort_saler,
                R.drawable.fort_gorakhgad,
                R.drawable.fort_malangad,
                R.drawable.fort_bhiravgad,
                R.drawable.fort_patagad,
                R.drawable.fort_hatgad,
                R.drawable.fort_hargad,
                R.drawable.fort_cavand,
                R.drawable.fort_tikona,
                R.drawable.fort_hargad,
                R.drawable.fort_sarasgad,
                R.drawable.fort_rasalgad,
                R.drawable.fort_rayreswar,
                R.drawable.fort_anjneri,
                R.drawable.fort_tringalwadi,
                R.drawable.fort_tahuli,
                R.drawable.fort_chandanvandan,
                R.drawable.fort_chambhargad,
                R.drawable.fort_navhi,
                R.drawable.fort_pratapgad,
                R.drawable.fort_prabalgad,
                R.drawable.fort_dategad,
                R.drawable.fort_harichandragad,
                R.drawable.fort_sakanshi,
                R.drawable.fort_mangitungi,
                R.drawable.fort_ghangad,
                R.drawable.fort_balapur,
                R.drawable.fort_mahuli,
                R.drawable.fort_shivneri,
                R.drawable.fort_devgiri,
                R.drawable.fort_santoshgad,
                R.drawable.fort_thalner,
                R.drawable.fort_jeevdhan,
                R.drawable.fort_chanderi,
                R.drawable.fort_nagardhan,
                R.drawable.fort_talgad,
                R.drawable.fort_manikgad,
                R.drawable.fort_kaldurg,
                R.drawable.fort_naldurg,
                R.drawable.fort_peb,
                R.drawable.fort_prachitgad,
                R.drawable.fort_taramati,


        };

        /** fort Name **/
        fortName = new String[]{
                " किल्ले रायगड ",
                " किल्ले सुधागड ",
                " किल्ले राजगड ",
                " किल्ले धोडप ",
                " किल्ले हडसर ",
                " किल्ले मोरागड ",
                " किल्ले महिपतगड ",
                " किल्ले लोहगड ",
                " किल्ले तुंग ",
                " किल्ले जंजिरा ",
                " किल्ले ढाकोबा ",
                " किल्ले नरनाळा ",
                " किल्ले बहिरी - गडदचा बहिरी ",
                " किल्ले गाविलगड ",
                " किल्ले लिंगाणा ",
                " कुर्डूगड - विश्रामगड ",
                " किल्ले मुल्हेर ",
                " किल्ले वारुगड ",
                " किल्ले वसंतगड ",
                " किल्ले महिमानगड ",
                " किल्ले सिंहगड ",
                " किल्ले मदनगड ",
                " किल्ले अंजनवेल (गोपालगड) ",
                " किल्ले तोरणा ",
                " किल्ले रोहीडा ",
                " किल्ले पुरंदर ",
                " किल्ले भुदरगड ",
                " किल्ले विसापूर ",
                " किल्ले साल्हेर ",
                " किल्ले गोरखगड",
                " किल्ले मलंगगड ",
                " किल्ले भैरवगड ",
                " किल्ले पट्टागड ",
                " किल्ले हातगङ ",
                " किल्ले हरगड ",
                " चावंड ",
                " तिकोना ",
                " किल्ले सरसगड ",
                " किल्ले रसाळगड ",
                " किल्ले रायरेश्र्वर ",
                " किल्ले अंजनेरी ",
                " किल्ले त्रिंगलवाडी ",
                " किल्ले ताहुली ",
                " किल्ले चंदन वंदन ",
                " किल्ले चांभारगड ",
                " किल्ले न्हावीगड ",
                " किल्ले राजमाची ",
                " किल्ले प्रतापगड",
                " किल्ले प्रबळगड ",
                " किल्ले दातेगड ",
                " किल्ले हरिश्चंद्रगड",
                " किल्ले सांकशी ",
                " किल्ले मांगी तुंगी ",
                " किल्ले घनगड ",
                " किल्ले बाळापूर",
                " किल्ले माहुली ",
                " किल्ले शिवनेरी ",
                " देवगिरी ",
                " किल्ले संतोषगड ",
                " किल्ले थाळनेर",
                " किल्ले जीवधन ",
                " किल्ले चंदेरी ",
                " किल्ले नगरधन ",
                " किल्ले तळगड ",
                " किल्ले माणिकगङ ",
                " काळदुर्ग",
                " किल्ले नळदुर्ग ",
                " किल्ले पेब ",
                " किल्ले प्रचीतगड ",
                " किल्ले तारामती ",
        };

        /** fort Introduction **/
        fortIntroduction = new String[]{
                "किल्ले रायगड मराठी साम्राजाच्या इतिहासामध्ये एक खास ओळख धरुरू आहे. छत्रपती शिवाजीराजांनी रायगडाचे स्थान आणि महत्त्व पाहून १७व्या शतकात याला आपल्या राज्याची राजधानी बनवण्याचे निश्चित केले. महाराजांचा राज्याभिषेक याच ठिकाणी झाला.अफ़झलखानाच्या स्वारीच्या काही महिने अगोदर त्यांनी रायरीचा किल्ला यशवंतराव मोरे याच्या कडून जिंकून घेतला आणि रायरीची भौगोलिक परिस्थिती लक्षात घेउन येथे बुलंद किल्ला बांधावा असे मनी घेतले. महाराजांचे त्यावेळचे शब्द बखरीत मिळतात. \"दीड गाव उंच - देवगिरीच्याहुन दशगुणी उंच जागा. पर्जन्यकाळी कड्यावर गवत उगवत नाही. उभ्या कड्यावर पाखरू उतरावयास जागा नाही. हे बघून महाराज खुषीने म्हणाले - तख्तास जागा हाच गड करावा.",
                "गडकोट म्हणजे राज्याचे मूळ. गडकोट म्हणजे खजिना . गडकोट म्हणजे सैन्याचे बळ. सुधागड म्हणजे भोर संस्थानाचे वैभव. सुधागड हा फार प्राचीन किल्ला आहे. पूर्वी या गडाला भोरपगड असेही म्हणत असत. पुढे हिंदवी स्वराज्याचे संस्थापक श्री शिवछत्रपतींचा पदस्पर्श या गडाला झाला आणि याचे नाव सुधागड ठेवले गेले. या गडाची साधारणतः उंची ५९० मीटर आहे. झाडांमध्ये लपलेला हा गड विस्ताराने फारच मोठा आहे. या गडावर जाण्यासाठी तीन प्रमुख वाटा आहेत.",
                "हिंदवी स्वराज्याची राजधानी, गडांचा राजा, राजियांचा गड! शिवतिर्थ रायगड! हिंदवी स्वराज्याची राजधानी गडांचा राजा, राजियांचा गड राजगड हे शिवाजी महाराजांचे पहिले प्रमुख राजकीय केंद्र. बुलंद, बेलाग आणि बळकट राजगड आजही आपल्याला हिंदुस्वराज्याची ग्वाही देत उभा आहे. पुण्याच्या नैऋत्येला ४८ कि.मी. अंतरावर अन् भोरच्या बायव्येला २४ कि.मी. अंतरावर नीरा-वेळवंडी-कानंदी आणि गुंजवणी नांच्या खो-यांच्या बेचक्यात मुरुंबदेवाचा डोंगर उभा आहे. मावळभागामध्ये राज्यविस्तार साध्य करण्यासाठी राजगड आणि तोरणा हे दोन्ही किल्ले मोक्याच्या ठिकाणी होते. तोरणा जरी अभेद्य असला तरी बालेकिल्ला आकाराने लहान असल्यामुळे राजकीय केंद्र म्हणून हा किल्ला सोयीचा नव्हता. त्यामानाने राजगड दुर्गम असून त्याचा बालेकिल्ला तोरणा किल्ल्यापेक्षा मोठा आहे. शिवाय राजगडाकडे कोणत्याही बाजूने येताना एखादी टेकडी किंवा नदी ओलांडावीच लागते एवढी सुरक्षितता होती,म्हणून आपले राजकीय केंद्र म्हणून शिवाजी महाराजांनी राजगडाची निवड केली.राजगडाला तीन माच्या व बालेकिल्ला आहे. बालेकिल्ला सर्वात उंच असून त्याची समुद्रसपाटीपासूनची उंची १३९४ मीटर आहे.शिवतीर्थ रायगड श्री शिवछत्रपतींच्या कर्तृत्वाचा विस्तार दाखवतो तर दुर्गराज राजगड त्यांच्या महत्वाकांक्षेची उंची दाखवतो.",
                "नाशिक जिल्ह्याच्या मध्यभागातून जाणारी सह्याद्रीची पूर्वपश्चिम डोंगररांग म्हणजे अजंठा-सातमाळा ही होय. अजंठा-सातमाळा रांग म्हणजे गिरीदुर्गाची साखळी आहे. या साखळीमधील सर्वात उंच आणि बलदंड किल्ला म्हणजे धोडप हा होय. शिवलिंगासारख्या आकाराचा माथा असलेला धोडप या आकारामुळे दूरवरुन स्पष्टपणे ओळखू येतो.\n" +
                        "धोडपला येण्यासाठी कळवणहून ओतूर गाव गाठल्यास उत्तरेकडील डोंगरदांडाने धोडपवर चढाई करता येते. डोंगराच्या पठारावर धोडपचा माथा उंचावलेला आहे. उत्तरेकडून अथवा दक्षिणेकडून आपण चढाई करुन प्रथम या पठारावर येतो. या विस्तृत पठारावर असलेल्या झाडीझाडोप्यामध्ये लपलेल्या अनेक वास्तू आपल्याला पहायला मिळतात. यामध्ये अनेक जोती, मंदिरे, पुष्करणी, मुर्ती, कबरी आढळतात.\n" +
                        "या पठारावर सोनारवाडी नावाचे छोटेसे गाव म्हणण्यापेक्षा छोटीशी वस्ती आहे. या वस्तीच्या जवळूनच गडाच्या माथ्यावर जाणारी वाट आहे. काही कातळकोरीव पाय-या कड्यावर आहेत. एका बोगदेवजा मार्गाने आपण या बालेकिल्ल्यामध्ये प्रवेश करतो. या माथ्यावर सुळक्यासारखा भाग आहे.",

                "सह्याद्री म्हणजे दुर्गांची खाणच. पुणे जिल्ह्यातील जुन्नर तालुका असाच गडकिल्ल्यांनी नटलेला आहे. हडसर  हा असाच या भागातील सुंदर किल्ला आहे.",
                "भौगोलिक दृष्टया पाहिले तर मोरागड हा मुल्हेर किल्ल्याचाच एक भाग आहे. मोरागड म्हणजे मुल्हेर किल्ल्याचा दुसरा बालेकिल्लाच होय.",
                "खेड तालुक्याच्या पूर्वेस १२ मैलांवर रसाळगड-सुमारगड आणि महिपतगड ही डोंगररांग उभी आहे. या मध्ये उत्तरेकडचा महिपतगड हा सर्वात उंच आणि विस्ताराने सुद्धा प्रचंड आहे. किल्ल्याचे क्षेत्रफळ १२० एकर आहे.हे तीन किल्ले एकमेकांच्या जवळजवळ असल्यामुळे अनेक ट्रेकर्स महिपतगड-सुमारगड-रसाळगड असा ट्रेक देखील करतात. ",
                "पवनामावळात असणारा आणि लोणावळा बोर घाटाचाक संरक्षक असणारा हा लोहगड पुणे - मुंबई हमरस्त्यावरून सहजच नजरेस पडतो.",
                "किल्ल्याच्या नावावरून आपल्या सर्वांना असेच वाटेल की, किल्ला चढायला खरोखरच कठीण आहे मात्र किल्ला चढण्यास फारच सोपा\n" +
                        "आहे. पवन मावळ प्रांतातील तुंग किल्ला हा एक घाटरक्षक दुर्ग म्हणून ओळखला जातो. पूर्वी बोरघाटामार्गेचालणा-या वाहतुकीवर नजर ठेवण्यासाठी या किल्ल्याचा उपयोग होत असे. या किल्ल्यावरून लोहगड ,विसापूर ,पवन मावळ हा सर्व परिसर नजरेत येतो.",

                "महाराष्ट्राला मोठा सागर किनारा लाभला आहे. अनेक खाड्यामुळे हा सागर किनारा दंतुर झालेला आहे. सृष्टी सौंदर्याने नटलेल्या या सागर किनार्याजवळ अनेक प्रेक्षणीय आणि ऐतिहासिक घटनांना उजाळा देणार्या अनेक स्थळांचा समावेश होतो. या किनार्यावर असलेल्या जलदुर्गांमध्ये रायगड जिल्ह्यातील जंजिरा हा एक अभेद्य किल्ला आहे.",
                "जुन्नर परिसरातील घाटाच्या अगदी कडेवर मीना मावळ आंणि कुकड मावळातील अणे-माळशेज डोंगररांगेतील हा सर्वोच्च जुळा किल्ला. दुर्ग आणि ढाकोबा या जुळ्या किल्ल्यांच्या उभारणीमागे घाटवाटांवर लक्ष ठेवणे हा उद्देश होता.\n",

                "अकोट तालुक्याच्या उत्तरेला साधारण २४ कि.मी. वर सातपुड्याच्या उंच डोंगरावर तो पसरलेला आहे.अकोल्या पासुन याचे अंतर ६६ कि.मी. आहे. गडाच्या खाली शहानुर नावाचे गाव आहे. गडाच्या पायथ्यापासून मेळघाट व्याघ्रप्रकल्प सुरू होतो. ",
                "लोणावळ्याच्या उत्तरेला दहा मैलांवर असलेल्या राजमाची किल्ल्यावर वर्षभर दुर्गप्रेमी येत असतात. मात्र याच राजमाचीजवळ निबीड अरण्यात असलेल्या बुलंद आणि बेलाग अशा ढाकच्या किल्ल्याची फारशी कोणाला ओळख नाही. या किल्ल्याची आपल्या सारख्या रानावनात हिंडणा-या मंडळीना ओळख करून दिली ती म्हणजे 'गो. नी. दांडेकर' यांनी. ढाकचा बहिरी म्हणजे 'ढाकचा किल्ला' आणि 'गडदचा बहिरी'.\n" +
                        "ढाकच्या किल्ल्याच्या बाजूस असणा-या सुळक्याला 'कळकरायचा सुळका' असेही म्हणतात. ",
                "हा किल्ला चिखलदर्या जवळ, मेळघाट व्याघ्र प्रकल्पामधे आहे.\n" +
                        "किल्ल्याच्या भवती घनदाट जंगल आहे. १२ व्या  १३ व्या शतकात गवळ्यांनी बांधलेला हा किल्ला नंतर बलाढ्य़ गोंडानी घेतला.",
                "लिंगाच्या आकाराचा हा किल्ला महाडपासून ईशान्येस सोळा मैलांवर असून सह्याद्रीच्या मुख्य रांगेत तोरणा व रायगड यांचे दरम्यान आहे. लिंगाण्याचे खडक २९६९ फूट उंच असून त्याची चढण ४ मैल लांबीची आहे. तटबंदी पूर्ण नष्ट झाली आहे, बाकी आहेत ते फक्त काही हौद व धान्य कोठाराच्या खुणा. मोर्यांचा पराभव केल्यावर शिवाजीने रायगडाजवळ हा किल्ला बांधला. ",
                "सह्याद्रीच्या कुशीत पुणे व रायगड जिल्ह्यांच्या सरहद्दीवर रायगड जिल्ह्यातील माणगाव तालुक्यात ह्याचा समावेश होतो, माणगावपासून २० कि.मी. वरील ह्या किल्ल्याचा माथा समुद्रसपाटीपासून ७०० मीटर उंचीवर आहे समुद्रसपाटीपासून जरी उंची कमी असली तरी खाडी चढण किवा लांबच लांब उजाड मार्गाने हा किल्ला जवळ करावा लागतो .",
                "सह्याद्री पर्वताच्या उत्तर-दक्षिण रांगेची सुरुवात नाशिक जिल्ह्यातील बागलाणातून होते. उत्तरेकडून सुरू होणा-या या सह्याद्रिच्या रांगेला सेलबारी किंवा डोलबारी रांग असे म्हणतात. सेलबारी रांगेवर मांगी-तुंगी सुळके, न्हावीगड, तांबोळ्या असे गड आहेत तर दुस-या डोलबारी रांगेवर मुल्हेर, मोरागड, साल्हेर, हरगड, सालोटा हे गडकिल्ले आहेत. पश्चिमेकडील गुजरात मधील घनदाट जंगल असलेला डांगचा प्रदेश आणि महाराष्ट्रातील बागलाण विभाग यांच्या सीमेवर हे किल्ले वसलेले आहेत. बागुलगेड म्हणजेच बागलाण. सुपीक, संपन्न आणि सधन असा प्रदेश. गुजरात आणि महाराष्ट्राच्या सीमेवरील हा प्रदेश असल्याने येथील जनजीवनावर गुजराती आणि महाराष्ट्रीय अशा संमिश्र आचारविचारांचा प्रभाव पडलेला आहे. पाण्याचे प्रमाण जास्त असल्याने बागायती शेती मोठा प्रमाणावर चालते त्यामुळे लोकांची आर्थिक स्थिती ही फार चांगली आहे. मुल्हेरचा किल्ला हा नाशिक जिल्ह्यात सटाणा तालुक्यात आहे. किल्ल्याच्या पायथ्याशी मुल्हेर नावाचे गाव आहे.",
                "माणागंगा नदी जिथे उगम पावते त्या सीताबाईच्या डोंगरात डाव्या कुशीवर एक किल्ला आहे त्याचे नाव आहे वारुगड.किल्ला माण तालुक्यात\n" +
                        "दहिवडीच्या ईशान्येस २० मैलांवर आहे.",
                "पुणे बंगळुरु हा राष्ट्रीय महामार्ग सातारा जिल्ह्यामधून जातो. या महामार्गावर सातारा उंब्रज कर्हाड अशी गावे आहेत. यात उंब्रज आणि कर्हाड यांच्या मधे पश्चिमेकडे इतिहास प्रसिद्ध तळबीड हे गाव आहे. तळबीड गाव वसंतगड या किल्ल्याच्या पायथ्याचे गाव आहे. ",
                "किल्ला माण तालुक्यात दहिवाडी नावाच्या खेडाच्या पश्चिमेला ५.५० मैलांवर शिद्रिबुद्रुक खेडात येतो.सातारा जिल्ह्यातील माण तालुका हा कमी पावसाचा त्यामुळे पावसाचे दुर्भिक्ष याच्या पाचवीला पुजलेलं",
                "पुण्याच्या नैऋत्येला साधारण २५ कि.मी अंतरावर असणारा हा किल्ला समुद्रसपाटीपासून सुमारे ४४०० फुट उंच आहे. सह्याद्रीच्या पूर्व शाखेवर पसरलेल्या भुलेश्वराच्या रांगेवर हा गड आहे. दोन पायर्यासारखा दिसणारा खंदकाचा भाग आणि दूरदर्शनचा उभारलेला मनोरा यामुळे पुण्यातून कुठुनही तो ध्यानी येतो. पुरंदर, राजगड, तोरणा, लोहगड, विसापुर, तुंग असा प्रचंड मुलुख या गडावरुन दिसतो.",
                "सह्याद्री मधील कठीण अशा गडकिल्ल्यांमध्ये एक गड म्हणजे मदनगड. किल्ला तसा बराच प्राचीन आहे आणि तेवढाच दुर्गम सुद्धा.",
                "अंजनवेल हा भारताच्या महाराष्ट्र राज्यातील एक किल्ला आहे. हा गोपालगड या नावानेपण ओळखला जातो.",
                "तोरणा अथवा प्रचंडगड म्हणजे पुणे जिल्ह्यातला सर्वात उंच डोंगर. शिवाजी महाराजांनी घेतलेल्या पहिल्या काही किल्ल्यांपैकी हा एक किल्ला होता.\n" +
                        "पुणे जिल्ह्याच्या वेल्हा तालुक्यातून गेलेल्या सह्याद्रिच्या रांगेतून दोन पदर निघुन पुर्वेला पसरत गेलेले आहेत, पैकी एका पदरावर तोरणा व राजगड आहेत तर दुसर्या पदराला भुलेश्वर रांग असे म्हणतात.\n",
                "सह्याद्रीच्या डोंगररांगेत भोर ते महाबळेश्र्वर असा एक सुरेख डोंगरमार्ग आहे. या डोंगररांगेत ३ ते ४ किल्ले आहेत. यापैकी एक रोहीड खो-यात वसलेला किल्ला म्हणजेच किल्ले रोहीडा. रोहीडखोरे हे नीरा नदीच्या खो-याच्या काही भागात वसलेले आहे.",
                "सह्याद्रीच्या दक्षिणोत्तर पसरलेल्या मूळ रांगेतून काही फाटे पूर्व दिशेकडे फुटले आहेत. त्यापैकी एका फाट्यावर सिंहगड आहे. तोच फाटा पूर्वेकाडे अदमासे २४ कि. मी. धावून भुलेश्वर जवळ लोप पावतो. याच डोंगररांगेवर पुरंदर, वज्रगड वसलेला आहे. कात्रज घाट, बापदेव घाट, दिवे घाट हे तीन घाट ओलांडून पुरंदरच्या पायथ्याशी जाता येते.\n" +
                        "किल्ल्याच्या चौफेर माच्या आहेत. किल्ला पुण्याच्या आग्नेय दिशेला अंदाजे २० मैलांवर तर सासवडच्या नेऋत्येला ६ मैलांवर आहे. गडाच्या पूर्वेला बहुतांशी प्रदेश सपाट आहे तर पश्चिमेला डोंगराळ प्रदेश आहे. वायव्येला १३-१४ मैलांवर सिंहगड आहे. तर पश्चिमेला १९-२० मैलांवर राजगड आहे.\n" +
                        "पुरंदर किल्ला तसा विस्ताराने मोठा आहे. किल्ला मजबूत आसून बचावाला जागा उत्तम आहे. गडावर मोठी शिबंदी राहू शकते. दारुगोळा व धान्याचा मोठा साठा करून गड दीर्घकाळ लढवता येऊ शकत असे. एक बाजू सोडली तर गडाच्या इतर सर्व बाजू दुर्गम आहेत. गडावरुन सभोवारच्या प्रदेशावर बारीक नजर ठेवता येते.",
                "आठशे मीटर लांब व सातशे मीटर रुंदी़चा हा किल्ला तेथील भैरवनाथाच्या जागृत देवस्थानामुळे प्रसिध्द आहे. किल्ल्याला दोन दरवाजे आहेत.",
                "पुण्याकडे जातांना लोणावळा सोडले की लोहगड-विसापूर ही जोडगोळी गिर्यारोहकांचे लक्ष वेधून घेत असते. मळवली रेल्वेस्थानकावर उतरल्यावर समोरच दिसतो तो म्हणजे लोहगड. मात्र डोंगरामागे लपलेला विसापूर किल्ला भाजे गावात गेल्यावरच नजरेस पडतो. पवनामावळात मोडणारा आणि लोणावळा (बोर) घाटाचे संरक्षण हा विसापूर किल्ला करतो. पूर्वीपासूनच दुर्लक्षित असलेला हा विसापूर किल्ला इतिहासात फार मोठे असे स्थान मिळवू शकला नाही.",
                "महाराष्ट्रात जसा सर्वात उंच शिखराचा मान कळसूबाईचा,तसा गडकिल्ल्यांमध्ये सर्वाधिक उंचीचा मान साल्हेरचा.बागलाण हा मोक्षगंगा आणि अक्षगंगा या नांमुळं समृध्द झालेला प्रदेश.येथील भूमी तशी सुपिकच त्यामुळे येथील लोकांचे रहाणीमान तसे थोडे उंचावलेले.तरीही डोंगरी भागात कोकण ,भिल्ल सारख्या काही आदीवासी जमाती रहातात. साल्हेर गडाचा घेरा साधारणपणे ११ कि.मी.असून व्यापलेले क्षेत्र ६०० हेक्टर आहे.\n",
                "गोरखगड हा मुंबईकरांसाठी आणि पुणेकरांसाठी एका दिवसात करता येण्याजोगा किल्ला आहे. गोरखगड आणि मच्छिद्रगडाला तसा ऐतिहासिक वारसा नसला तरी त्यांच्या सुळक्यांमुळे प्रस्तरारोहकांसाठी ते नेहमीच एक आकर्षण ठरले आहे. गोरखगड आणि मच्छिद्रगड याच्या आजुबाजूचा परिसर प्रसिद्ध आहे तो म्हणजे येथील घनदाट अभयारण्यामुळे. गोरखगडाचा विस्तारही तसा मर्यादितच आहे. ",
                "मलंगगड कल्याणपासून दक्षिणेस १६ कि.मी. अंतरावर एका उंच डोंगरावर बांधलेला आहे. बदलापूरच्या नैऋत्येस व मुंबई आणि साष्टीच्या पूर्वेस हा किल्ला आहे. करंजा व उरण नैऋत्येस आणि बोरघाट,भीमाशंकर व माळशेज घाट पूर्वेस असा हा भाग लढाईच्या दृष्टीने अतिशय महत्त्वाचा आहे.",
                "भैरवगड हा कोयनानगरच्या विभागात मोडणारा किल्ला आहे. येथील किल्ल्यांचे वैशिष्ट म्हणजे सर्व किल्ले घाटमाथ्याच्या सलग रांगेपासून दुरावलेले आहेत. त्यामुळे दुरून हे किल्ले दिसत नाही. घनदाट जंगल हे येथील मुख्य आकर्षण.",
                "सह्याद्रीच्या उत्तर दक्षिण रांगेची सुरुवात इगतपुरी परिसरातून थळघाटाच्या पूर्वेकडे जाते याच रांगेला कळसूबाई रांग म्हणतात. याच रांगेच्या पश्चिमेकडे अलंग, मदन, कळसूबाई तर पूर्वेकडे औंढ, पट्टा, बितनगड, आड हे किल्ले आहेत. अलंग, मदन, कुलंग येथे असणारे घनदाट जंगल, दुर्गमवाटा यामुळे येथील किल्ल्यांची भटकंती फारच अवघड आहे तर औंढ, पट्टा, या परिसरातील भ्रमंती फारच सोपी आहे. ",
                "सुरगणा नाशिक मधील एक तालुका.सह्याद्रीच्या पूर्व भागातीलएका रांगेची सुरवात याच तालुक्यापासून होते.यालाच सातमाळ रांग असे म्हणतात.या सातमाळ रांगेतील किल्ले म्हणजे जणु काय एक तटबंदीच.याच रांगेच्या उपशाखेवर एक छोटासा किल्ला आहे त्याचे नाव हातगङ या भागातील जनजीवन मात्र सामान्यच.थोडा फार आधुनिक सुविधा इथपर्यंत देखील पोहचल्या आहेत.",
                "इतिहासात फारसा या गडाचा उल्लेख नाही कारण येथे कोणती मोठी लढाई झाली नाही. मुल्हेर गावात गेल्यावर हरगडचे दर्शन होते. समोर दिसणारा मुल्हेर,डावीकडे मोरागड आणि उजवीकडचा हरगड. या गडाची उंची मुल्हेरपेक्षा थोडी जास्त आहे ",
                "जुन्नर तालुक्यामध्ये नाणेघाटाचे पहारेकरी म्हणून नावलौकिक मिळवलेले किल्ले म्हणजे जीवधन, चावंड, हडसर आणि शिवनेरी.",
                "पवना नदीवरील धरणाजवळ पुण्याच्या साधारण ६० कि.मी अंतरावर असणारा हा किल्ला समुद्रसपाटीपासून सुमारे ३,५०० फूट उंच आहे.\n" +
                        "तुंग किल्ला ३-४ कि.मी अंतरावर दिसतो. किल्ल्याच्या त्रिकोनी आकारामुळे याला तिकोना असे नाव पडले.\n",
                "पालीगावाच्या पूर्वेस हा किल्ला आहे.",
                "सह्याद्रीची रांग उत्तरदक्षिण पसरलेली आहे. मुख्य रांगेपासून सुटावलेल्या अनेक रांगा पाच पंचवीस मैल लांबवर पसरलेल्या आहेत. पोलादपूर सोडून खेडवरून चिपळूणकडे जाताना रसाळगड, सुमारगड, महिपतगड हे तीन दुर्ग आपले लक्ष वेधून घेतात. हे सर्व किल्ले जावळीच्या खोर्यातच येतात. प्रतापगड, मधुमकरंदगड, रसाळगड, सुमारगड आणि महिपतगड हा ट्रेकही खूप प्रसिद्ध आहे. ",
                "पाचगणीचे टेबललॅन्ड सर्वांनाच माहितच असते मात्र त्याच्यापेक्षाही उंच आणि लांब असे टेबललॅन्ड म्हणजे रायरीचे पठार. भोरपासून ८ कि.मी. अंतरावर असणारे हे रायरीचे पठार पुण्याहून एका दिवसात पाहून येण्यासारखे आहे.दाट झाडी, खोल दर्या, उंचच्या उंच सुळके, अस्ताव्यस्त पसरलेली पठारे, लांबच लांब सोंडा आणि आडवळणी घाट. यामुळे हा परिसर तसा दुर्गमच आहे.",
                "अंजनेरी हा नाशिक - त्र्यंबकेश्वर रांगेतील महत्वाचा किल्ला आहे. नाशिक - त्र्यंबकेश्वर रस्त्यावर नाशिकपासून २० कि.मी. अंतरावर अंजनेरी नावाचा फाटा आहे.",
                "सोपी इगतपुरी परिसरातून सह्याद्रीची एक रांग पश्चिमेकडे पसरली आहे. याच रांगेत त्रिंगलवाडी बळवंतगड आणि कावनई हे किल्ले आहेत.",
                "कल्याण, कर्जत व पनवेल या विभागात हा किल्ला आहे. ताहुलीला किल्ला किंवा गड म्हणणे तसे अयोग्यच. हा त्याच्या तीन\n" +
                        "सुळक्यांमुळे प्रसिद्ध आहे. उंच बेलाग कडे, जाण्याच्या अनगड वाटा यामुळे ताहुली वैशिष्टपूर्ण आहे आणि कदाचित यामुळेच दुर्लक्षितही आहे.गडावरील पहाण्यासारखी ठिकाणे ताहुलीच्या पठारावर संत गाडगेबाबा महाराजांचा मठ आहे. या वाटेत आणखी दोन आश्रम लागतात.",
                "कथा आणि कादंबरी मध्ये जुळ्या भावा विषयी आपण नेहमीच ऐकत असतो मात्र दुर्गविश्र्वातही अशी जुळी भावंडे आढळतात त्यांच्यापैकीच एक चंदन-वंदन. सातारच्या अलीकडे २४ कि.मी. अंतरावर ही दुर्गजोडी उभी आहे.",
                "रायगडाच्या आजूबाजूला असणा-या डोंगररांगावर अनेक किल्ले आहेत. यांत प्रामुख्याने लिंगाणा,काळदुर्ग,सोनगड व चांभारगड यांचा समावेश होतो.यांचा उपयोग केवळ घाटमथ्यावर नजर ठेवण्यासाठी व टेहेळणीसाठी होत असावा. चांभारगड हा महाडपासून हाकेच्या अंतरावर आहे. ",
                "सह्याद्री पर्वताच्या उत्तर-दक्षिण रांगेची सुरुवात नाशिक जिल्ह्यातील बागलाणातून होते. उत्तरेकडून सुरू होणा-या या सह्याद्रिच्या रांगेला सेलबारी किंवा डोलबारी रांग असे म्हणतात. सेलबारी रांगेवर मांगी-तुंगी सुळके, न्हावीगड, असे गड आहेत तर दुस-या डोलबारी रांगेवर मुल्हेर, मोरागड, साल्हेर, हरगड, सालोटा हे गडकिल्ले आहेत. पश्चिमेकडील गुजरात मधील घनदाट जंगल असलेला डांगचा प्रदेश आणि महाराष्ट्रातील बागलाण विभाग यांच्या सीमेवर हे किल्ले वसलेले आहेत.",
                "सह्याद्रीच्या लोणावळा खंडाळा पासून निघणा-या डोंगररांगेमुळे निर्माण झालेला परिसर 'उल्हास नदीचे खोरे' म्हणून ओळखला जातो.याच परिसरातून उल्हास नदी उगम पावते.याच 'उल्हास नदीच्या खो-यांच्या प्रदेशात मुंबईपुणे लोहमार्गावर लोणावळ्याच्या वायव्येस १५ कि.मी अंतरावर राजमाची किल्ला वसलेला आहे.",
                "नीरा आणि कोयनेच्या काठावर शिवाजी महाराजांनी जी सत्ता मिळविली होती, ती सत्ता अबाधित ठेवण्यासाठी एक मजबूत किल्ला निर्माण करण्याची गरज निर्माण झाली आणि हा किल्ला म्हणजे प्रतापगड होय. प्रतापगडाची निर्मिती इ.स. १६५७ झाल्याचे नोंद इतिहासात मिळते. उत्तर सातारा जिल्ह्याच्या जावळी तालुक्यात महाबळेश्वराच्या पश्चिमेस ८ मैलावर प्रतापगडाचा डोंगर आहे. पार आणि किनेश्वर या दोन गावांमधल्या डोप-या नावाच्या एका टेंभावर या किल्ल्याची बांधणी झाली आहे. ",
                "मुंबई-पुणे हमरस्त्यावरुन जातांना दिसणारा हा नावाप्रमाणे बलवान असणारा एक दुर्ग चटकन आपले लक्ष वेधून घेतो. पूर्वेला उल्हास\n" +
                        "नदी, पश्चिमेला गडी नदी, दक्षिणेला पाताळगंगा नदी, माणिकगड आणि नैऋत्येला कर्नाळा किल्ला, तसेच जवळच असलेला इर्शाळगड\n" +
                        "असा चहूबाजूंनी वेढलेला हा किल्ले मुरंजन उर्फ प्रबळगड.",
                "पाटण जवळील दातेगड हा किल्ला प्रेक्षणीय असून देखील उपेक्षित राहिलेला आहे.\n" +
                        "चारी बाजूंनी नैसर्गिक काळ्या कातळाची तटबंदी लाभलेल्या दातेगडाचे दुर्गवैशिष्ट्ये म्हणजे या गडावरील बऱ्याच वास्तू दगडातच खोदून तयार केल्या आहेत.\n",
                "हा किल्ला पुणे, नाशिक आणि अहमदनगर या तीन जिल्ह्यांच्या सीमेवर स्थित आहे.",
                "पेण जवळील बळवली येथे सांकसे/सांकशीचा किल्ला आहे. या तालुक्याचे पुर्वीचे नाव सांकसे/सांकशीचा या किल्ल्यावरून पडले.",
                "बागलाण सुपीक,सधन आणि संपन्न असा मुलूख. सह्याद्रीच्या उत्तर दक्षिणेची सुरुवात होते ती या बागुलगेड बागलाण विभागातूनच होते. येथे असणार्या दुहेरी पूर्व-पश्चिम रांगेला सेलबारी-डोलबारी असे संबोधण्यात येते. ताहराबादला पोहोचले की मांगी-तुंगीचे दोन सुळके आपले लक्ष्य वेधून घेतात. मांगी-तुंगी ही जैन लोकांची तीर्थक्षेत्रे.",
                "मुळशीच्या पश्चिमेला एक मावळ भाग आहे यालाच कोरसबारस मावळ म्हणतात.याच मावळात येणारा हा घनगड.",
                "विदर्भातील अकोला हा महत्त्वाचा जिल्हा असून या जिल्ह्यामध्ये बाळापूर हे तालुक्याचे ठिकाण आहे. मान आणि महीषी या नद्यांच्या संगमावर बाळापूर वसलेले आहे. जळगाव ते अकोला या राष्ट्रीय महामार्गावर बाळापूर असून ते बुलढाणा तसेच वाशिम या जिल्ह्यांच्या ठिकाणांना गाडीमार्गाने जोडलेले आहे.",
                "ठाणे जिल्ह्यात शहापूर-आसनगावाजवळ एक दुर्गत्रिकुट आहे. माहुली-भंडारगड आणि पळसगड मिळून हे बळकट ठाणे तयार झाले आहे. मुद्दाम जाऊन पहावे असे हे ठिकाण कोणाही निसर्गप्रेमी माणसाला आपल्या निसर्गसौंदर्याने वेड लावते. अनेक सुळके असलेला लांबलचक असा हा डोंगर माहुली नावाने ओळखला जातो. माहुलीचे दोन खोगिरामुळे तीन भाग पडले आहेत. उत्तरेचा पळसगड, मधला माहुलीगड आणि दक्षिणेचा भंडारगड.",
                "जुन्नर गावाजवळ, पुण्यापासून अंदाजे १०५ कि.मी. वर आहे.\n" +
                        "शिवनेरी हे छत्रपती श्री शिवाजी महाराजांचे जन्मस्थान आहे.\n" +
                        "या किल्ल्याला चारही बाजूंनी कठीण चढाव असून जिंकावयास कठीण असा बालेकिल्ला आहे. किल्ल्यावर शिवाई देवीचे छोटे मंदिर व जिजाबाई व बाल-शिवाजी यांच्या प्रतिमा आहेत.\n" +
                        "या किल्ल्याचा आकार शंकराच्या पिंडीसारखा आहे. शिवनेरी किल्ला पुणे जिल्ह्यातील जुन्नर शहरात आहे. जुन्नर मध्ये शिरतानांच शिवनेरीचे दर्शन होते.किल्ला तसा फार मोठा नाही.१६७३ मध्ये ईस्ट इंडिया कंपनीतील डॉ. जॉन फ्रायर याने या किल्ल्याला भेट दिली. त्याने आपल्या साधनग्रंधात, या किल्ल्यावर हजार कुटुंबांना सात वर्षेपुरेल एवढी शिधासामुग्री आहे असा उल्लेख केला आहे.",
                "महाराष्ट्रात जे काही भुईकोट किल्ले आहेत त्यापैकी हा एक. युद्धपद्धती आणि युद्धकलेतील गरजांच्या फेरबदलांना अनुसरुन या किल्ल्याची रचना आणि बांधणीही वेळोवेळी होत गेली असावी. याचसाठी दौलताबादचा किल्ला सैन्यवास्तुकलेतील प्रगतीचे प्रतीक म्हणून गणला जातो.\n" +
                        "ह्या किल्ल्याचा नकाशा, भिंती आणि प्रवेशद्वाराची रचना अशी योजनाबद्ध रीतीने करण्यात आलेली आहे की, शत्रूच्या हल्ल्यापासून किल्ला सुरक्षित राखता येईल असे वळणा-वळणाचे अरुंद रस्ते शत्रुसैन्याच्या सहज प्रवेशाला थोपवून धरतात. तर उंच,उंच भिंती किल्लेबंदी करणा-या उरतात. संपूर्ण किल्ला चहूकडून जलमय कालव्यांनी वेढलेला आहे. किल्ल्याची उंची गाठण्यासाठी डोंगर पोखरुन तयार करण्यात आलेल्या दूर्गम, अतिसुरक्षित असे अंधारे बोगदे ओलांडावे लागतात. किल्ल्याच्या या रचनेमुळे लक्षात येते की, शत्रुची दिशाभुल करण्यासाठी आणि त्याला फसवण्यासाठी अशी रचना केलेली असावी.\n",
                "सह्याद्रीची मुख्य डोंगररांग प्रतापगडापासून तीन भागांमध्ये विभागली गेलेली आहे.शंभूमहादेव रांग ,बामणोली रांग आणि म्हसोबा रांग यापैकी म्हसोबा डोंगररंगेवर संतोषगड,वारुगड,महिमानगड आणि वर्धनगड हे किल्ले आहेत",
                "धुळे जिल्हा हा खानदेशातील एक जिल्हा आहे. धुळे जिल्ह्यातील थाळनेरचा किल्ला हा इतिहासप्रसिद्ध किल्ला असून तो धुळ्याच्या ईशान्य दिशेला आहे. तापी नदीच्या काठावर वसलेल्या थाळनेर गावालगतच थाळनेरचा किल्ला आहे.",
                "घाटघरच्या परिसरात असलेला हा पुर्वमुखी किल्ला प्राचीन नाणेघाटाच्या व्यापारी मार्गाच्या संरक्षणासाठी उभारण्यात आला होता.\n" +
                        "नाणेघाटापासून जीवधन किल्ला अगदी हाकेच्या अंतरावर आहे. ",
                "मुंबई-पुणे लोहमार्गावरून कल्याणहून कर्जतकडे जाताना एक डोंगररांग आहे. त्यातून आपला भलाथोरला माथा उंचावलेला एक प्रचंड सुळका दिसतो, त्याचे नाव चंदेरी. बदलापूर-वांगणी स्थानकादरम्यान बदलापूर-कर्जत रस्त्यावर गोरेगाव नावाचे गाव आहे. येथूनच चंदेरीची वाट आहे. नाखिंड,चंदेरी,म्हसमाळ नवरी बोयी या डोंगररांगेतील एक व पनवेलच्या प्रभामंडळाचे मानकरी असणा-या कर्नाळा, प्रबळगड, इरशाळगड, माणिकगड, पेब, माथेरान आणि अशा कितीतरी गडांपैकी एक म्हणजे चंदेरी होय. चंदेरीच्या पायथ्याशी असलेली घनदाट वृक्षराजी, गवताळ घसरडी वाट अन् मुरमाड निसरडा कातळमाथा म्हणजे सह्याद्रीतील एक बेजोड आव्हान आहे. \n",
                "धार्मिक स्थळ म्हणून प्राचीन काळापासून प्रसिद्ध आहे. महाराष्ट्रातील भाविकांबरोबर इतर राज्यांमधूनही अनेक भाविकांचा ओघ रामटेकला असतो. रामटेक पासून सहा-सात किलोमिटर अंतरावर एक बलदंड भुईकोट किल्ला आहे. हा किल्ला म्हणजे नगरधनचा किल्ला होय.",
                "रोह्याच्या आजुबाजुला अनेक डोंगररांगा पसरलेल्या आहेत.या डोंगररांगा पसरलेल्या आहेत.या डोंगररांगावर अनेक किल्ले ठाण मांडून बसलेले आहेत.त्यापैंकी तळगड हा एक किल्ला.",
                "मुंबई पुणे हमरस्त्यावरुन जातांना अनेक किल्ले आपल्याला दिसतात.प्रबळगड,इरशाळ,चंदेरी,माथेरान,कर्नाळा,लोहगड, विसापूर आणि यांच्या संगतीतच एक किल्ला आहे त्याचे नावं माणिकगङ. कर्नाळा,सांकशी,माणिकगड हे या रांगेतील तीन भाऊ.\n",
                "ठाणे जिल्हयातील पालघर विभागात अनेक डोंगरी किल्ले आहेत. शहरी भागापासून फारसे लांब नसल्यामुळे, ठाणे व जव्हारच्या सीमेवर असणारे हे किल्ले मुंबईकरांना एका दिवसात आरामात पाहता येतात. ",
                "महाराष्ट्राचे गिरीदुर्ग, जलदुर्गाबरोबरच अनेक महत्त्वाचे असे वैशिष्ट्यपूर्ण भुईदुर्ग किंवा भुईकोट किल्ले आहेत. या भुईकोट किल्ल्यांमध्ये महत्त्वाचा असा किल्ला म्हणजे नळदुर्ग होय.",
                "पनवेलच्या ईशान्येला मुंबई पुणे मार्गावरील नेरळपासून पश्चिमेला तीन - चार किलोमीटर अंतरावर हा किल्ला आहे. माथेरानसारख्या सुंदर थंड हवेच्या ठिकाणी असलेल्या माणसांच्या गर्दीपासून मोकळीक हवी असल्यास निसर्गप्रेमींनी पेबचा किल्ला विसरू नये. एरवीदेखील एका दिवसाच्या ट्रेकसाठी 'पेब' सारखी जवळची आणि निसर्गरम्य जागा शोधून सापडणार नाही. किल्ला चढण्यासाठी लागणारा वेळ ,चढण्याची वाट ,वरील गुहेची रचना ,गुहेसमोरील निसर्गरम्य दृश्य अशा अनेक बाबतीत हा गड 'गोरखगडाशी' साधर्म्य साधतो",
                "संगमेश्वर तालुक्याच्या शृंगारपूर या ऐतिहासिक गावाजवळ प्रचितगड आहे. या गडावर सह्याद्री पर्वतामधून वाट काढत जायचे म्हणजे बिकट परिस्थितीची व अनेक संकटांची प्रचिती घ्यावी लागते.\n",
                "हा किल्ला पुणे, नाशिक आणि अहमदनगर या तीन जिल्ह्यांच्या सीमेवर स्थित आहे. हा किल्ला पूर्ण किल्ला नसून हरिश्चंद्रगडावरील तीन शिखरांपैकी एक आहे.",


        };

        /** fort History **/
        fortHistory = new String[]{

                "जगातील इतर सर्व गुहांपेक्षा या गुहेची रचना पूर्ण वेगळी आहे. पाचाड खिंडीतून इथवर चढून आले की गुहेचे एक तोंड दिसते. या तोंडातून आत गेले की समोर येणारे दृश्य अचंबित करणारे आहे. दोन गोलाकृती प्रचंड भोके पलीकडील बाजूला आहेत. तिथवर गेले, की पाचाडचा भुईकोट किल्ला, पाचाड गाव व पाचाडपासून ते पाचाड खिंडीकडे येणारा घाटरस्ता व्यवस्थित पाहता येतो.\n" +
                        "या गुहेत सतत वाहणारा थंडगार वारा, एकापाठोपाठ येणार्या थंड वार्याच्या झुळुका आपला सारा थकवा दूर करतात. ज्या अर्थी अश्मयुगीन मानवाची इथे वस्ती होती. त्याअर्थी इथे जवळपास बारमाही पाण्याचे एखादे नैसर्गिक ठिकाण निश्चित असणार. त्याचा शोध घ्यायलाच हवा. रायगड पाहायला शेकडो-हजारो दुर्ग यात्रींना या वाघबीळ गुहेची कल्पनाच नसते. अश्मयुगीन मानवाचे जुने वसतिस्थान, ३ तोंडे असणारी गुहा, तेथून दिसणारा उत्कृष्ट देखावा, सतत वाहणारा थंड वारा याचं आकर्षण येथे भेट देणार्याला पडते.",

                "सुधागड हा किल्ला फार प्राचीन आहे. या परिसरात अस्तित्वात असणारी ठाणाळे लेणी, ही २२०० वर्षांपूर्वीची आहेत. यावरून\n" +
                        "असे अनुमान निघते की सुधागड हा देखील तितकाच जुना किल्ला असावा. एखाा मोठा सत्तेखाली या गडाची जडणघडण झाली असावी. पुराणात भृगु ऋषींनी येथे वास्तव्य केल्याचे अनेक उल्लेख आढळतात. याच ऋषींनी भोराई देवीची स्थापना या डोंगरावर केली. इ. स. १६४८ साली हा किल्ला स्वराज्यात सामील झाला. \n" +
                        " गडाच्या पायथ्याशी असलेल्या 'पाच्छापूर' या गावातच संभाजी व औरंगजेबाचा बंडखोर मुलगा अकबर याची भेट झाली होती. महाराजांच्या अष्टप्रधान मंडळात असलेल्यांपैकी अण्णाजी दत्तो, बाळाजी आवजी चिटणीस, त्याचा मुलगा आवजी बल्लाळ, आणि हिरोजी फर्जंद या सर्वांना भाद्रपद पौर्णिमेच्या दिवशी संभाजीने सुधागड परिसरात असणार्या परली गावात हत्तीच्या पायी दिले.गडावरील पहाण्यासारखी ठिकाणे : या गडाचा घेरा तसा मोठा आहे.गडावर पाण्याचे अनेक तलाव आढळतात.गडावर पंत सचिवांचा वाडा आहे. यात ५० जणांची राहण्याची सोय होते. तसेच भोराई देवीचे मंदिर आहे. यामध्ये २५ जणांची राहण्याची सोय होते. येथे जंगलही ब-यापैकी आहे. आजुबाजूच्या जंगलाच्या परिसरात अनेक प्रकारची औषधी वनस्पती आढळतात. गडावरील पंत सचिवांच्या वाडाच्या बाजूला भोरेश्र्वराचे मंदिर आहे. तिथूनच पुढे गेल्यावर एक चोरदरवाजाची विहीर आहे. सचिवांच्या वाडापासून पुढे पाय-यांची वाट जाते आणि सरळ भोराई देवीच्या मंदिरात आणून सोडते. जर ही वाट सोडून खालची वाट पकडली तर पुढे पाण्याची टाके आहेत.\n" +
                        "या टाक्यातील पाणी पिण्यासाठी उपयुक्त आहे. टाक्यांच्या डावीकडील वाट ही आपणांस चोर दरवाज्यांकडे आणून सोडते. ",

                "इतिहासातून अस्पष्ट येणा-या उल्लेखांवरुन सातवाहनपूर्व म्हणजे साधारण २००० वर्षा पूर्वी पासूनचा हा डोंगर आहे. ब्रम्हर्षी ऋषींचेयेथे असणारे वास्तव्य व याच ब्रम्हर्षी ऋषींच्या नावावरुन येथे स्थापन झालेले श्री ब्रम्हर्षी देवस्थान यावरुन डोंगर फार पुरातन असावा.राजगडाचे पूर्वीचे नाव होते मुरंबदेव हा किल्ला बहमनी राजवटी मध्ये याच नावाने ओळखला जात असे अर्थात त्यावेळी गडाचे स्वरूप फार काही भव्य दिव्य असे नव्हते. इसवी सन १४९० च्या सुमारास अहमदनगरच्या निजामशाहीचा संस्थापक अहमद बहिरी याने वालेघाट आणि तळकोकणातील अनेक किल्ले जिंकून पश्चिम महाराष्ट्रात प्रभाव निर्माण केला आणि याच वेळी त्याने मुरूंबदेव हा किल्ला हस्तगत केला. मुरुमदेवाचे गडकरी बिनाशर्त शरण आल्यामुळे अहमद बहिरीला किल्ला जिंकण्यास विशेष प्रयास करावे लागले नाही. पुढे किल्ल्यावर निजामशाहीची सत्ता प्रस्थापित झाल्यावर १२५ वर्षे किल्ल्यावर कोणाचाही हल्ला झाला नाही. इसवी सन १६२५ च्या सुमारास मुरूमदेव किल्ला निजामशाही कडून आदिलशही कडे आला. निजामशहाच्या वतीने बाजी हैबतराव शिलीमकर व त्याचे वडीलरुद्राजी नाईक या किल्ल्याची व्यवस्था पाहत होते.\n" +
                        "मलिक अंबरच्या आदेशानुसार बाजी हैबरावाने मुरुमदेवाचा ताबा आदिलशाही सरदार हैबतखामाकडे दिला. १६३० च्या सुमारास हा किल्ला आदिलशहाकडून परत निजामशाहीत दाखल झाला. शहाजीराजांचा अधिकारी सोनाजी या किल्ल्याचा कारभार पाहू लागला. विजापूर आदिलशाही सैन्याच्या एका तुकडीने किल्ल्यावर हल्ला केला. त्यात सोनाजी जखमी झाला. म्हणून बालाजी नाईक शिळीमकर आपल्या तुकडीसह मुरुमदेवाच्या रक्षणार्थ धावून गेला. तेव्हा बालाजी नाईक जखमी झाला. या कामगिरी बद्दल शहाजीराजांनी बाळाजी नाईक शिलीमकरांचा नंतर सन्मानही केला. शिवरायांनी मुरुमदेवाचा किल्ला कधी\n" +
                        "घेतला याचा लिखीत पुरावा आज मात्र उपलब्ध नाही त्यामुळे किल्ला ताब्यात कधी आला हे सांगणे अनिश्चितच आहे.",
                "राघोबा दादा आणि पेशवे यांच्यामध्ये झालेल्या संघर्षामध्ये धोडपचे स्थान महत्त्वाचे आहे. येथेच त्यांची दिलजमाई झाली होती. पुढे १८१८ मध्ये हा किल्ला इंग्रज अधिकारी ब्रिग्ज याने मराठ्याकडून जिंकून घेतला.",

                "हडसर किल्ल्याचे दुसरे नाव म्हणजे पर्वतगड. सातवाहनकालात या गडाची निर्मिती झाली असून या काळात गड मोठा प्रमाणावर राबता होता. नाणेघाटाच्या संरक्षणासाठी नगरच्या सरहद्दीवर हा किल्ला बांधला गेला. १६३७ मध्ये शहाजी राजांनी मोगलांशी केलेल्या तहामध्ये हडसर किल्ल्याचा समावेश होता, असा उल्लेख ऐतिहासिक कागदपत्रांमध्ये आढळतो. यानंतर १८१८ च्या सुमारास ब्रिटिशांनी जुन्नर व आसपासचे किल्ले जिंकले. हडसर किल्ल्याच्या वाटाही ब्रिटिशांनी सुरुंग लावून फोडल्या.",

                "गडमाथ्यावर जाताना दुसर्या दरवाजाच्याजवळ एक गुहा आहे. गडमाथा म्हणजे एक पठारच होय.माथ्यावर दोन ते तीन पाण्याची टाकी आहेत.एक सुंदर बांधीव तलाव आहे. दोन तीन वाडांचे अवशेष आपले अस्तित्व टिकवून आहेत. बाकी गडावर काही नाही.",
                "महिपतगड हा नावाप्रमाणेच महिपत आहे. किल्ला तसा आकाराने फार मोठा आहे. चहुबाजूंचे कडे तुटलेले असल्यामुळे प्रत्येक ठिकाणी तटबंदीची गरज भासत नाही. काही ठिकाणी जिथे कडा चढण्यास सोपा आहे तिथे तटबंदी उभारली आहे. सध्या मात्र ही तटबंदी पडून गेलेली आहे. किल्ल्याला एकूण सहा दरवाजे आहेत. ईशान्येकडे लालदेवडी दरवाजा, पूर्वेस पुसाटी दरवाजा, दक्षिणेकडे खेड दरवाजा, पश्चिमेस शिवगंगा दरवाजा, उत्तरेकडे कोतवाल दरवाजा, आग्रेयेस यशवंत दरवाजा. सःस्थितीला हे दरवाजे नाममात्र उरलेले आहेत. ",
                "लोहगड किल्ला हा अति मजबूत, बुलंद आणि दुर्जेय आहे. किल्ल्याची निर्मिती जवळ असणारी भाजे आणि बेडसे ही बौद्धकालीन लेणी ज्या काळी निर्माण झाली, त्याही पूर्वी म्हणजेच सत्तावीशसे वर्षांपूर्वी झालेली असावी असे अनुमान निघते. सातवाहन, चालुक्य, राष्ट्रकूट, यादव या सर्व राजवटी या किल्ल्याने पाहिल्या.इ. स. १४८९ मध्ये मलिक अहमंदने\n" + "निजामशाहीची स्थापना केली आणि अनेक किल्ले जिंकून घेतले. त्यापैकीच लोहगड हा एक. इ. स. १५६४ मध्ये अहमदनगरचा सातवा राजा दुसरा बुर्हाण निजाम या किल्ल्यावर कैदेत होता. इ. स. १६३० मध्ये किल्ला आदिलशाहीत आला. १६५७ मध्ये शिवाजी महाराजांनी कल्याण आणि भिवंडी परिसर जिंकून घेतला आणि लोहगड - विसापूर हा सर्व परिसर सुद्धा स्वराज्यात सामील करून घेतला. इ. स. १६६५ मध्ये झालेल्या पुरंदरच्या तहात हा किल्ला मोगलांच्या स्वाधीन केला गेला. पुढे १३ मे १६७० मध्ये मराठांनी किल्ला परत जिंकला. पहिल्या सुरत लूटेच्या वेळेस आणलेली संपत्ती नेताजी पालकरने लोहगडावर आणून ठेवली होती. इ. स. १७१३ मध्ये शाहूमहाराजांनी कृपावंत होऊन लोहगड कान्होजी आंग्रे यांस दिला.",
                "या किल्ल्याला तशी वैभवशाली इतिहासाची परंपरा लाभलेली नाही. मात्र १६५७ मध्ये मावळ प्रांतातील इतर किल्ल्यांसमवेत हा किल्ला देखील स्वराज्यात सामील झाला. सन १६६० मध्ये या भागाच्या सुरक्षिततेसाठी नेताजी पालकर यांची नियुक्ती झाली. जयसिंगाने आणि दिलेरखानाने आपल्या स्वारीच्या वेळी ६ मे १६६५ रोजी तुंग आणि तिकोना या भागातील अनेक गावे जाळली पण, हे किल्ले मात्र जिंकू शकले नाही. १२ जून १६६५ पुरंदर तहानुसार १८ जूनला कुबादखानाने हलालखान व इतर सरदारांसोबत ह्या परिसराचा ताबा घेतला.",
                "जंजिरा हा शब्द अरबी भाषेतून आपल्याकडे रुढ झालेला आहे. अरबी भाषेतील जझीरा या शब्दावरुन तो आलेला आहे. जझीरा म्हणजे बेट. या बेटावर पूर्वी एक मेढेकोट होता. त्यावेळी राजपुरीला मुख्यत: कोळी लोकांची वस्ती होती. या कोळ्यांना लुटारु आणि चाचे लोकांचा नेहेमीच उपद्रव होत असे. तेव्हा या चाच्यांना प्रतिबंध करण्यासाठी या बेटावर मेढेकोट उभारण्यात आला. मेढेकोट म्हणजे लाकडाचे मोठाले ओंडके एका शेजारी एक रोवून तयार केलेली तटबंदी. या तटबंदीमध्ये कोळी लोक सुरक्षितपणे रहात असत. त्यावेळी त्यांचा प्रमुख होता राम पाटील. हा मेढेकोट बांधण्यासाठी त्यावेळी निजामी ठाणेदाराची परवानगी घ्यावी लागली होती. मेढेकोटाची सुरक्षितता लाभताच राम पाटील त्या ठाणेदाराला जुमानीसा झाला. त्यामुळे ठाणेदाराने त्याचा बंदोबस्त करण्यासाठी पिरमरवानाची नेमणूक केली.\n" +
                        "राम पाटील आपल्याला मेढेकोटाच्या जवळही फिरकू देणार नाही, याची कल्पना पिरमनवानाला होती. तो अतिशय चतुर होता. त्याने आपण दारुचे व्यापारी आहोत, असे भासवून आपली गलबते खाडीत नांगरली. राम पाटीलाशी स्नेह राहावा म्हणून दारुचे काही पिंप त्याने भेट म्हणून पाठवली. त्यामुळे राम पाटील खूष झाला. पिरमरवानाने मेढेकोट पाहण्याची इच्छा व्यक्त केली. पिरमरवाना मेढेकोटात गेला. रात्री सर्व कोळी दारु पिऊन झिंगले असताना पिरमरवानाने बाकीच्या गलबतांमधून असलेले सैन्य तेथे उतरवून सर्वांची कत्तल करुन मेढेकोट ताब्यात घेतला.\n" +
                        "जंजिर्याचे सिद्दी हे मुळचे ऑबिसिनियामधील. हे दर्यावर्दी शूर, काटक व दणकट होते. त्यांनी प्राणपणाने जंजिरा लढवला. अनेकांनी जंजिरा जिंकण्याचा प्रयत्न केला. पण तो यशस्वी होवू शकला नाही. छत्रपती शिवाजी राजांनाही जंजिर्यावर स्वामित्व मिळवता आले नाही. इ.स.१६१७ ते १९४७ अशी ३३० वर्षे जंजिरा अंजिक्य राहिला. जंजिर्याचे प्रवेशद्वार पूर्वाभिमुख आहे. होडीने आपण प्रवेशद्वारापर्यंत पोहोचतो. या प्रवेशद्वाराच्या आत एक उपदार आहे. प्रवेशद्वाराजवळ एक शिल्प आहे. बुर्हाणखानाची दर्पोक्तीच या चित्रातून दिसून येते. एका वाघाने चारही पायात चार हत्ती पकडलेत व शेपटीत एक हत्ती गुंडाळला आहे, असे ते चित्र आहे. बुर्हाणखान इतर सत्ताधिशांना सुचवतोच की, तुम्ही हत्ती असाल, मी पण शेर आहे. या किल्ल्याकडे वाकड्या नजरेने पाहण्याचे धाडस करु नका.\n" +
                        "या किल्ल्यातील सिद्दी सरदारांनी हा किल्ला सदैव अजिंक्य राखला. शिवाजी महाराजांनी तर हा किल्ला हस्तगत करण्यासाठी य किल्ल्यानजिक पाच सहा कि.मी. अंतरावर पद्मदुर्ग नावाचा मजबूत किल्ला उभारला होता पण तरीही जंजिरा जिंकणं महाराजांना शक्य होऊ शकलं नाही.",
                "ढाकोबाच्या कड्यावरुन खाली कोकणाचे विहंगम दृष्य दिसते. किल्ल्यावर पाहण्यासारखी ठिकाणे म्हणजे कोकणात उतरणारा रौद्र कडा आणि ढाकोबाचे मंदिर. ढाकोबाजवळच दुर्ग हा अजून एक जुळा किल्ला आहे. शेजारीच दाऱ्या घाट नावाची कोकणात उतरणारी घाटवाट आहे. या घाटवाटेच्या खाली पूर्वी कोकणात असलेल्या 'म्हसे' या गावी होणाऱ्या जनावरांच्या बाजारात जाण्यासाठी हा एक प्राचीन मार्ग वापरला जाई. आजही स्थानिक लोक कोकणात जाण्यासाठी हीच वाट वापरतात.",
                "गडाच्या प्रवेशाला पाच दरवाजे लागतात त्यांवरून या गडाच्या सुरक्षा व्यवस्थेची कल्पना यावी. सर्वात आधी शहानुर दरवाजा, मग मोंढा दरवाजा, त्यानंतर अत्यंत सुरेख कलाकुसर असलेला महाकाली दरवाजा, असे करीत आपण गडावर पोहचतो. गडाच्या मध्यावर सक्कर तलाव नावाचा विर्स्तीण जलाशय आहे. याला बारमाही पाणी असते. हा तलाव याच्या औषधी गुणांकरिता पंचक्रोशीत प्रसिद्ध आहे. कुणाला कुत्रा चावल्यास त्याने या तलावात स्नान करून येथील दर्ग्यावर गुळफुटाने वाहावे व तडक गड उतरावा.",
                "",
                "महाभारतात भीमाने किचक राक्षसा बरोबर लढाई करून त्याचा इथे वध केला व बाजूच्या दरीत फेकून दिले अशी नोंद आहे. किचकाची दरी म्हणजे किचकदरा. चिखलदरा हा किचकदरा या शब्दाचा अपभ्रंश आहे.\n" +
                        "इ.स. १८०३ मध्ये दुसर्या मराठे-इंग्रज युद्धात या किल्यावर महत्त्वपूर्ण लढाई झाली होती. आर्थर वेलस्लीच्या इंग्रज सैन्याने मराठ्यांचा निर्णायक पराभव केला.",
                "इथल्या गुहेत, जे जुने कारागृह होते, एका वेळेस ५० कैदी ठेवत.  १६६५ सालच्या पुरंदर तहामध्ये रायगड आणि त्या परिसरातले किल्ले लिंगाणा व बाणकोट महाराजांकडेच राहिले.  लिंगाण्याच्या गिर्दनवाहीचे देव श्रीजननी व सोमजाई हे होत. त्यांच्या नवरात्राच्या उत्सवाच्या रायगडाच्या जमाखर्चातून तरतूद होत असे. या देवतांना बकरे बळी देण्याची प्रथा होती. लिंगाणा किल्ला रायगडचा पूरक होता. त्याच्या डागडुजीचे काम रायगडाबरोबरच चालत असे. १७८६ सालापर्यंत त्यावरील वास्तूंची देखभाल केली जात असे असा उल्लेख आढळतो. त्यामध्ये गडावरील सदर, बुरूज, दरवाजे आणि धान्यकोठार यांचा समावेश असे.  तेथे पर्जन्यकाळात एक मनुष्य गस्त घाली. रायगड नंतर लिंगाणा पडला. रायगडाच्या खोर्यात थोडी विश्रांती घेऊन इंग्रजांचे विजयी सैन्य २३ मे रोजी पाली पलीकडील मार्गास लागले.",
                "किल्यानाजीकच पायथ्याशी चरी कुर्डाई देवीचे मंदिर आहे .त्यावरूनच किल्ल्यास किल्ले कुर्डू हे नाव मिळालं.बाजी पासलकरांनी विश्रांतीकालासाठी या किल्ल्याचा उपयोग केल्याने त्यासच विश्रामगड हेही नामाभिमान प्राप्त झाले असे समजते ",
                "मुल्हेरचा किल्ला हा प्राचीन किल्ला आहे. पूर्वी किल्ल्यातच गाव वसलेले होते. मात्र कालांतराने गाव खाली उतरले आणि पायथ्यापासून सुमारे २ कि.मी. अंतरावर वसले. हे मुल्हेर गाव महाभारतकालीन आहे. याचे नाव होते रत्नपूर. या भागात मयूरध्वज नावाचा राजा होऊन गेला आणि गावाला मयूरपूर नाव पडले. तर किल्ल्याला मयूरगड हे नाव पडले. औरंगजेबाने किल्ला जिंकला तेव्हा याचे नाव औरंगगड असे ठेवण्यात आले. पुराणात मुल्हेरचा उल्लेख येतो. मात्र खात्रीलायक माहिती चौदाव्या शतकाच्या पहिल्या दशकात मिळते. मुल्हेरचा किल्ला बागुल राजांनी बांधला. इ.स. १३०८ ते १६१९ पर्यंत बागुलांनी येथे राज्य केले. या घराण्याच्या नावावरूनच परिसराला बागुलगेड व त्याचा अपभ्रंश बागलाण हे नाव पडले. बागुल राजे हे मुळचे कनोजचे. या बागुल घराण्याच्या काळातच जगप्रसिद्ध मुल्हेरी मूठ बनवण्यात आली.\n" +
                        "या घराण्यात एकूण ११ राजे झाले. या राजांना बहिर्जी ही पदवी होती. विजयनगरमध्ये हिंदू सत्ता प्रस्थापित होण्यापूर्वी कितीतरी अगोदर बागलाण मध्ये हिंदूसत्ता प्रस्थापित होती. अकबराने जेव्हा खानदेशाचे राज्य जिंकले तेव्हा प्रतापशहा बहिर्जी बागलाणचा राजा होता. त्याने मोगलांचे सार्वभौमत्व पत्करले. पुढे शाहजहानशी या राजाने मैत्रीपूर्ण संबंध निर्माण केले. जुलै १६३६ ला औरंगजेबाची दक्षिणेचा राज्यपाल म्हणून नेमणूक झाली. इ.स. १६३८ मध्ये मोगलांनी बागलाणवर हल्ला केला आणि मुल्हेर किल्ला जिंकला व त्याचे नाव औरंगगड असे ठेवले. १५ फेब्रुवारी १६३८ रोजी वैभवशाली हिंदुंचे राज्य संपुष्टात येऊन तेथे मोगलांची सत्ता प्रस्थापित झाली. मुल्हेर ही बागलाणची परंपरागत राजधानी.",
                "किल्ला शिवरायांनी बांधला असे सांगतात.या किल्ल्याचा किल्लेदार परभू जातीचा होता.२०० पहारेकरी व बरीच शिबंदी किल्ल्यावर होती.१८१८ मध्ये सातारच्या राजाच्या फडणीस विठ्ठलपंत याने २०० लोक पाठवून दुस-या बाजीरावाकडून घेतला.",
                "वसंतगडाची निर्मिती भोज शिलाहार राजाने केली. इ.स. १६५९मध्ये शिवरायांनी वसंतगड स्वराज्यात सामील करून घेतला. वसंतगडाजवळच मसूरला सुलतानजी जगदाळे राहत होता. अफजलखान चालून आला त्यावेळी वतनाच्या लोभाने जगदाळे फितुर झाला. वसंतगड घेतल्यावर मराठ्यांनी अकस्मात छापा घालून जगदाळेस पकडून गडावर आणले व फितुरीबद्दल त्याचा गडावर शिरच्छेद केला. शिवरायांच्या कठोर न्याय वसंतगडाने याची देहा याची डोळा अनुभवला. पुढे जिंजीहून परत आल्यानंतर छ. राजाराम महाराज वसंतगडावर काही दिवस मुक्कामास होते.\n" +
                        "इ.स. १७०० साली औरंगजेबाने हा किल्ला जिंकला. व त्याचे नाव 'किली-द-फतेह' असे ठेवले. पण इ.स. १७०८ साली मराठ्यांनी हा किल्ला पुन्हा जिंकला.",

                "साताराच्या पूर्वेकडील प्रांताचे संरक्षण करण्याकरीता शिवरायांनी जे किल्ले घेतले त्यापैकीच एक महिमानगड. पूर्वी किल्ल्याच्या रक्षणाकरीता महार रामोशी मिळून ७५ इसम ठेवलेले होते.किल्ल्याचा हवालदार आणि सबनीस यांची इनामे. ",
                "पूर्वी हा किल्ला आदिलशाहीत होता. दादोजी कोंडदेव हे आदिलशहाकडून सुभेदार म्हणून नेमले होते. पुढे इ.स. १६४७ मध्ये दादोजी कोंडदेवांच्या निधनानंतर कोंडाण्यावरील किल्लेदार सिद्दी अंबर याला लाच देऊन शिवाजी महाराजांनी हा किल्ला स्वराज्यात आणला आणि गडावर आपले लष्करी केंद्र बनवले. पुढे इ.स. १६४९ मध्ये शहाजी राजांच्या यांच्या सुटकेसाठी शिवाजी राजांनी हा किल्ला परत आदिलशहाला दिला. पुरंदरच्या तहात जे किल्ले मोगलांना दिले त्यामध्ये कोंढाणापण होता. मोगलांतर्फे उदेभान राठोड हा कोंढाण्याचा अधिकारी होता. हा मुळचा राजपूत पण नंतर मुसलमान झाला.सिंहगडचे मूळ नाव कोंढाणा होते आणि शिवाजी महाराजांच्या काळात त्यांचे विश्वासू सरदार आणि बालमित्र तानाजी मालुसरे आणि त्यांच्या मावळच्या सैन्याने हा किल्ला एका चढाई दरम्यान जिंकला. या लढाईत तानाजींना वीरमरण आले आणि जीवनाचे बलिदान देऊन हा किल्ला जिंकल्यामुळे शिवाजी महाराजांनी \"गड आला पण सिंह गेला\" हे वाक्य उच्चारले. पुढे त्यांनी गडाचे नाव सिंहगड असे बदलले. सिंहगड हा मुख्यतः प्रसिध्द आहे तो तानाजी मालूसरे यांच्या बलिदानामुळे.\n" +
                        "तानाजी मालुसरा म्हणून हजारी मवळियांचा होता. त्याने कबूल केले की, 'कोंडाणा आपण घेतो', असे कबूल करुन वस्त्रे, विडे घेऊन गडाचे यत्नास ५०० माणूस घेऊन गडाखाली गेला. आणि दोघे मावळे बरे, मर्दाने निवडून रात्री गडाच्या कड्यावरून चढवले. गडावर उदेभान रजपूत होता. त्यास कळले की, गनिमाचे लोक आले. ही खबर कळून कुल रजपूत कंबरकस्ता होऊन, हाती तोहा बार घेऊन, हिलाल (मशाल), चंद्रज्योती लावून बाराशे माणूस तोफाची व तिरंदाज, बरचीवाले, चालोन आले. तेव्हा मावळे लोकांनी फौजेवर रजपुतांचे चालून घेतले. मोठे युद्ध एक प्रहर झाले. पाचशे रजपूत ठार जाले. उदेभान किल्लेदार खाशा त्याशी व तानाजी मालुसरा यांशी गाठ पडली. दोघे मोठे योध्दे, महशूर, एक एकावर पडले. तानाजीचे डाव्या हाताची ढाल तुटली. दुसरी ढाल समयास आली नाही. मग तानाजीने आपले डावे हाताची ढाल करुन त्याजवर वोढ घेऊन, दोघे महरागास पेटले. दोघे ठार झाले. मग सुर्याजी मालूसरा (तानाजीचा भाऊ), याने हिंमत धरून, कुल लोक सावरुन उरले राजपूत मारिले. किल्ला काबीज केला. शिवाजी महाराजांना गड जिंकल्याची पण तानाजी पडल्याची बातमी मिळाली तेव्हा ते म्हणाले, 'एक गड घेतला, परंतु एक गड गेला'.\n" +
                        "माघ वद्य नवमी दि. ४ फेब्रुवारी १६७२ च्या रात्री हे युद्ध झाले.",
                "",
                "हा किल्ला सोळाव्या शतकात विजापूर च्या राजाने बांधला व इ.स. १६६० च्या आसपास शिवाजी महाराजांनी याचे पुनरुज्जीवन केले. या ठिकाणी सापडणार्या एका दगडावर मात्र इ.स. १७०७ हे वर्ष व बांधणार्याचे नाव सिद्दि साट असे लिहिलेले आढळते.",
                "शिवाजी महाराजांनी सुरुवातीच्या काळात जे काही किल्ले घेतले त्यापैकी एक किल्ला तोरणा होय. महाराजांनी गडाची पहाणी करताना त्याच्या प्रचंड विस्तारामुळे याचे नांव 'प्रचंडगड' असे ठेवले.\n" +
                        "पुण्याच्या नैऋत्येस पर्वतराजीमध्ये उत्तर अक्षांश व पुर्व रेखांशावर हा किल्ला आहे. किल्ल्याच्या दक्षिणेस वेळवंडी नदी तर उत्तरेस कानद नदिचे खोरे आहे. गडाच्या पश्चिमेस कानद खिंड तर पुर्वेस बामण व खरीव खिंडी आहेत.\n" +
                        "हा किल्ला कधी व कोणी बांधला याचा पुरावा उपलब्ध नाही. येथील लेण्यांच्या व मंदिरांच्या अवशेशावरुन हा शैवपंथांचा आश्रम असावा. इ.स. १४७० ते १४८६ च्या दरम्यान बहमनी राजवटीत मालिक अहमद याने हा किल्ला जिंकला. पुढे हा किल्ला निजामशाहित गेला. नंतर तो महाराजांनी घेतला व त्याचे नांव प्रचंडगड असे ठेवले.",
                "या किल्ल्याची निर्मिती ही यादवकालीन आहे. या किल्ल्यावरील तीस-या दरवाजावर असणा-या शिलालेखावरून\n" +
                        "मुहम्मद आदिलशहाने ह्या गडाची दुरुस्ती केली असे अनुमान निघते. या शिलालेखावरून मे १६५६ नंतर हा किल्ला शिवाजी\n" +
                        "महाराजांनी बांदल देशमुखांकडून घेतला असे समजते. किल्ला घेण्यासाठी राजांना बांदल देशमुखांशी हातघाईची लढाई करावी लागली. यात कृष्णाजी बांदल मारला गेला. बाजीप्रभू देशपांडे बांदलाचे मुख्य कारभारी होते. लढाईंतर बाजीप्रभू देशपांडे व इतर सहका-यांना स्वराज्यात सामील करून घेतले गेले. इ.स. १६६६ च्या पुरंदरच्या तहानुसार हा किल्ला मोघलांच्या स्वाधीन केला गेला. २४ जून १६७० रोजी शिवरायांनी किल्ला परत घेतला.कान्होजी यांच्याकडे भोरची पूर्ण तर रोहीडा किल्ल्याची निम्मी देशमुखी व जमिनीचे काही तुकडे इनाम होते. रोहीडाचे गडकरी त्यांचेकडून ३० होन घेत होते. शिवाजी महाराजांच्या अधिका-यांनी शिवाजी महाराजांकडे विचारणा केली की ३० च होन का, शिवाजी महाराजांनी निर्णय दिला की, जेधे आपले चाकर असल्यामुळे पूर्वापार चालत आलेले द्रव्यच घ्यावे. पुढे किल्ला मोघलांनी जिंकला, मात्र भोरच्या पंत सचिवांनी औरंगजेबाशी झुंजून किल्ला स्वराज्यात पुन्हा दाखल केला. संस्थाने विलीन होईपर्यंत राजगड, तोरणा, तुंग आणि तिकोना किल्ल्याप्रमाणे हा ही किल्ला भोरकरांकडे होता.",
                "पुरंदर म्हणजे इंद्र. ज्याप्रमाणे इंद्राचे स्थान बलाढ्य तसाच हा पुरंदर. पुराणात या डोंगराचे नाव आहे 'इंद्रनील पर्वत'. हनुमंताने द्रोणागिरी उचलून नेत असताना त्या पर्वतचा काही भाग खाली पडला तोच हा इंद्रनील पर्वत. बहामनीकाळी बेदरचे चंद्रसंपत देशपांडे यांनी बहामनी शासनाच्या वतीने पुरंदर ताब्यात घेतला. त्यांनी पुरंदरच्या पुनर्निर्माणास प्रारंभ केला. त्याच घराण्यातील महादजी नीळकंठ याने कसोशीने हे काम पूर्ण केले. येथील शेंदर्या बुरूज बंधाताना तो सारखा ढासळत असे. तेव्हा बाहिरनाक सोननाक याने आपला पुत्र नाथनाक आणि सून देवाकाई अशी दोन मुले त्यात गाडण्यासाठी दिली. त्यांचा बळी घेतल्यावरच हा बुरूज उभा राहिला. हा किल्ला सन १४८९ च्या सुमारास निजामशाही सरदार मलिक अहमद याने जिंकून घेतला. पुढे शके १५५० मध्ये तो आदिलशाहीत आला.\n" +
                        "इ. स. १६४९ मध्ये आदिलशहाने शहाजीराजांना कैदेत टाकले. याच वेळी शिवाजी महाराजांनी अनेक आदिलशाही किल्ले आपल्या ताब्यात घेतले.\n" +
                        "म्हणून शिवरायांचा बंदोबस्त करण्यासाठी आदिलशहाने फत्तेखानास रवाना केले. परिस्थिती फारच बिकट होती. एकीकडे आपले वडील कैदेत होते तर दुसरीकडे फत्तेखानाच्या स्वारीमूळे स्वराज्य धोक्यात येणार होते. महाराजांनी यावेळी लढाईसाठी पुरंदर किल्ल्याची जागा निवडली. मात्र यावेळी गड मराठ्यांच्या ताब्यात नव्हता. महादजी निळकंठराव यांच्या ताब्यात किल्ला होता. त्यांच्या भावभावांमधील भांडणाचा फायदा उठवून महाराजांनी किल्ल्यात प्रवेश करण्यात यश मिळवले. या पुरंदर किल्ल्याच्या सहाय्याने मराठ्यांनी फत्तेखानाशी झुंज दिली आणि लढाई जिंकली. शिवाजी महाराजांना या पहिल्या लढाईतच मोठे यश प्राप्त झाले. सन १६५५ मध्ये शिवाजीराजांनी नेताजी पालकर यास गडाचा सरनौबत नेमले. वैशाख शु. १२ शके १५७९ म्हणजेच १२ मे १६५७ गुरुवार या दिवशी संभाजी राजांचा जन्म पुरंदरावर झाला.",
                "इ.स. १६६७ मधे शिवाजी महाराजांनी भूदरगडाची नीट दुरूस्ती केली व त्यावर शिबंदी ठेवून ते एक प्रबळ लष्करी ठाणे बनवले. परंतु मोगलांनी हे ठाणे ताब्यात घेण्यास अल्पावधीतच यश मिळवले. पाच वर्षानी मराठ्यांनी भूदरगडावर अचानक ह्ल्ला करून तो जिंकून तर घेतलाच, पण मोगलांच्या प्रमुख सरदारास ठार मारले. मोगलांची निशाणे त्यांनी भैरवनाथास देउन टाकली ती अजूनही देवळात आहेत.\n" +
                        "अठराव्या शतकाच्या उत्तरार्धात परशुरामभाऊ पटवर्धनांनी किल्ल्यातील शिबंदी वश करुन त्यावर ताबा मिळवला. दहा वर्षे तो त्यांच्या ताब्यात राहिला.\n" +
                        "इ.स. १८४४ मध्ये कोल्हापूरातील काहींनी बंड करून बरेचसे किल्ले ताब्यात मिळविले होते. त्यात सामानगड व भूदरगड प्रमुख होते. त्यांचा बिमोड करण्यास जनरल डीलामोटीने ससैन्य कूच केले. १३ ऑक्टोबर १८४४ रोजी इंग्रजांच्या सैन्याने भूदरगडावर पूर्ण ताबा प्रस्थापित केला.\n" +
                        "असे बंडाचे प्रयत्त्न वारंवार होऊ नयेत म्हणून तेथील तटबंदीची बरीच पाडापाड केली.",
                "मराठे १६८२ सालच्या ऑक्टोबर महिन्यात पुण्याच्या उत्तर बाजूला स्वारीसाठी गेले. डिसेंबरच्या पहिल्या आठवडात शहाबुद्दीन चाकणमध्ये होता. मराठे लोहगडाच्या बाजूला आल्याचे समजल्यावर तो तेथे पोहचला. तेथे त्याने केलेल्या चकमकीत ६० माणसांची कत्तल झाली. तेथून मराठे विसापूर किल्ल्यावर गेल्याचे समजले म्हणून तो तेथे पोहचेपर्यंत मराठे कुसापुर गावाजवळ पोहचले. १६८२ मध्ये मराठांचा आणि मोगलांचा शिवाशिवीचा खेळ चालूच होता. ४ मार्च १८१८ ला जनरल प्रॉथर लोहगड जिंकण्यासाठी आला. त्याने सर्व प्रथम विसापूर जिंकला. ज्या दिवशी विसापूर इंग्रजांनी घेतला त्याच्या दुसर्याच दिवशी मराठे लोहगड सोडून गेले",
                "साल्हेर गड हा परशुरामाची तपोभूमी म्हणून प्रसिद्ध आहे.जिंकलेल्या पृथ्वीचे दान करून स्वतःसाठी भूमी मिळवण्यासाठी सागराला मागे हटवायला त्यांनी बाण सोडला तो याच भूमीवरून.असे पौराणिक स्थान असलेल्या साल्हेरचे शिवकालीन इतिहासातील स्थान देखील महत्वाचे आहे, ते येथे झालेल्या प्रसिद्ध लढाईमुळे. शिवरायांनी १६७१ मध्ये बागलाण मोहिम काढली आणि साल्हेर जिंकून घेतला.त्या मोहिमेची वार्ता दिल्लीच्या पातशहाला मिळाली .ते एकून पातशहा कष्टी झाला ,नि म्हणाला ,'काय इलाज करावा ,लाख लाख घोडाचे सुभे रवाना केले ते बुडवले नामोहरम होऊन आले. आता कोण पाठवावे '\n" +
                        "तेव्हा पातशहाने 'शिवाजी जोवर जिवंत तोवर दिल्ली आपण सोडीत नाही' असा विचार केला आणि इखलासखान व बहोलोलखान यांस बोलावून वीस हजार स्वारांनिशी सालेरीस रवाना केले.\n" +
                        "मग इखलासखानाने येऊन साल्हेरला वेढा घातला. हे वर्तमान जेव्हा राजांना कळले तेव्हा मोगलाईत पाठवलेले आपले सरनौबत प्रतापरावांना जासूदाकरवी कळविले 'तुम्ही लष्कर घेऊन सालेरीस जाऊन बेलोलखानास धारून चालविणे आण कोकणातून मोरोपंत पेशव्यांनाही हशमानिशी रवाना केले. ' हे इकडून येतील तुम्हीही वरघाटी कोकणातून येणे असे दुतर्फा चालून येऊन गनिमास गर्दीस मिळवणे ' अशी पत्रे पाठविली.\n" +
                        "त्याप्रमाणे एकीकडून प्रतापराव तर दुसरीकडून पेशवे, उभयता सालेरीस आले,आणि मोठे युध्द झाले. सभासद बखरीत याचा उल्लेख् खालील प्रमाणे आढळतो ''चार प्रहर दिवस युध्द जाहले मोगल, पठाण, रजपूत, तोफांचे, हत्ती, उंट आराबा घालून युध्द जाहले. युध्द होताच पृथ्वीचा धुराळा असा उडाला की , तीन कोश औरस चौरस ,आपले व परके लोक माणूस दिसत नव्हते . हत्ती रणास आले दुतर्फा दहा हजार माणूस मुर्दा जाहले पूर वहिले.रक्ताचे चिखल जाहले.त्यामध्ये रुतो लाबले ,असा कर्दम जाहला. मराठांनी इखलासखान आणि बेलोलखानाचा पाडाव केला.",
                "शहाजी राजांच्या काळात या गडाला महत्त्व होते. मात्र येथे कोणत्याही प्रकारच्या लढाईचा उल्लेख नाही. शिवकालात गडाचा उपयोग केवळ आसपासच्या प्रदेशवर नजर ठेवण्यासाठी होत असे.पूर्वी नाणेघाट मार्गेजुन्नरला जातांना या गडाचा निवासस्थान म्हणून वापर करत असत. मर्यादित विस्तार असूनही मुबलक पाणी, निवा-याची योग्य जागा मात्र या गडावर उपलब्ध आहे. गोरक्षनाथांच्या साधनेचे हे ठिकाण म्हणूनच याचे नाव 'गोरखगड'.\n",

                "ऍबिंग्डन ह्या इंग्रजी अधिकार्याने १७८० मध्ये मंलगगडाला वेढा घातला. पावसाळ्यात मराठे युद्ध टाळतात. हे लक्षात घेऊन बेसावध मराठ्यांवर भर पावसातच हल्ला करण्याचे त्याने ठरवले. लढाई सुरू होताच नैऋत्य व उत्तरेकडच्या वाटा बंद करून टाकल्या. त्याने प्रथम पीरमाची घेण्याचे ठरवले. तेथे पांडुरंग केतकर यास ३०० माणसांनिशी नेमलेले हाते. अचानक हल्ला झाल्यामुळे मराठ्यांनी प्रतिकार केला नाही. १२५ जण सोने माचीकडे धावले. तर बाकी गडावर जागा नव्हती म्हणून कल्याणच्या मामलेदाराकडे धावले. ऍबिंग्डनने गडावर पोहचण्यासाठी गडाच्या पायथ्यापासून पीर माचीपर्यंत वाट शोधून काढली. नाना फडणविसाने वेढा उठवण्याचा प्रयत्न केला पण तो यशस्वी झाला नाही. ऍबिंग्डनने पीर माचीच्या पठारावर तीन तोफा चढवल्या व सोने माचीवर गोळीबार चालू केला. पण प्रवेशद्वार मोठा खुबीने बांधले असल्यामुळे तेथवर गोळे पोहचेनात. मराठांना जंगलातल्या अनेक चोरवाटा माहीत असल्यामुळे त्यांचा बाहेरच्या जगाशी संपर्क तुटण्याचा संभव नव्हता.\n" +
                        "किल्लेदाराने आनंदराव धुळप व काशीपंत यांच्याकडे मदत मागितली पण त्यांनी प्रत्यक्ष न येता ७०० शिपाई पाठवले जे तेथवर पोहचू शकले नाहीत. कॅप्टन ऍबिंग्डनने शिडा लावून २५० माणसे सोने माचीवर चढवली. पण मराठानी गडावरून दगडधोंडांचा वर्षाव करून त्यांना परत पाठवले. ऍबिग्डनने पीर माचीवरून तोफा काढून घेतल्या. गंगाधररावानने संधी साधून दाणापाणी व दारूगोळा भरून धेतला\n" +
                        ". नाना फडणीसांनी बाळाजी विश्र्वनाथ पाठक व राधोविश्र्वनाथ गोडबोले यांना सैन्य देऊन वेढा उठवण्यास पाठवले. त्यांच्या फौजा शिरवळ या मलंगच्या उत्तरेला असलेल्या गावी पोहचल्या. मराठ्यांची फौज तीन हजारावर होती. त्यांनी शत्रूला हुसकावून लावण्याचे प्रयत्न केले. पण ते अयशस्वी झाले. १६ सप्टेंबरला गारांची एक पलटण पीर माचीवर चाल करून गेली. त्यांनी तोफांवर हल्ले केल्यामुळे ब्रिटिशांनी घाईघाईने तोफा काढून घेतल्या. मेजर वेस्टफॉलने ऍबिंग्डनच्या मदतीसाठी जादा कुमक धाडली. या सेनेने रसद घेऊन येणार्या मराठ्यांच्या तुकडीला उध्वस्त केले. त्यामुळे मलंगगडावर अन्नधान्याचा तुटवडा भासू लागला. काही धान्य पावसाने नासले, खजिना संपत आला.मराठ्यांनी इंग्रजांचेही दळणवळण तोडून टाकले होते. तेंव्हा कर्नल हार्टलेने बेलापूर,पनवेल,तळोजे मार्ग सुरक्षित केला. ",
                "इतिहासात या गडाचा उल्लेख कोठेही आढळत नाही. मात्र या गडाचा वापर केवळ टेहळणी साठी असावा असे येथील बांधकामावरून दिसते. गडावरील पहाण्यासारखी ठिकाणे : भैरवगडावर पाहण्यासारखे फार काहीच नाही. गडावर एक मंदिर आहे. मंदिर फारच प्रशस्त आहे. मंदिर मजबूत आणि कौलांनी शाकारलेले आहे. मंदिरात भेरी देवी, श्री तुळा देवी, श्री वाघजाई देवी यांच्या २-३ फुटी मूर्ती आहेत. या लाकडी मंदिरावर बरेसचे कोरीव काम आढळते. मंदिरासमोरच्या प्राकारात तुळशीवृंदावन, शंकराच्या पिंडीचा चबुतरा दिसतो. तसेच समोर दोन तीन खांब देखील दिसतात. समोरच शंकराचे मंदिर सुद्धा आहे. मंदिरासमोरच खाली उतरणार्या वाटेने थोडे पुढे गेल्यावर दोन तीन बुरूज लागतात.",
                "पट्टागड शिवाजी महाराजांनी इ.स.१६७१ मध्ये जिकूंन घेतला.\n" +
                        "पट्टा किल्ल्याचा माथा म्हणजे एक मोठे पठारच आहे. येथून अलंग, मदन, कुलंग, कळसूबाई, त्रिंबकगड हा सर्व परिसर नजरेत भरतो. या सर्व परिसरावर नजर ठेवण्यासाठी या किल्ल्यांचा उपयोग होत असे.\n" +
                        "शिवरायांनी हा किल्ला जिंकला आणि याचे नामकरण 'विश्रामगड' असे केले. जालानापूरची लूट केल्यानंतर शिवाजी महाराजांनी काही काळ या किल्ल्यावर घालवला. पुढे इ.स.१६८६ पर्यंत हा सर्व परिसर मराठांच्या ताब्यात होता. १६८२ साली औरंगजेबाने महाराष्ट्रात पदार्पण केले आणि मराठी मुलूख ताब्यात घेण्यास सुरवात केली.\n" +
                        "१६८८ साली मातबरखानाने बागलाणातील अनेक गड घेण्यास सुरवात केली होती. पट्टागडा संबंधी मातबरखान औरंगजेबाकडे अर्ज पाठवतो त्यात तो म्हणतो सेवकाने काही दिवसांपासून १००० कोळी, भिल्ल, व मावळे यांचे पथक सैन्यात घेतले आहे. मराठांच्या ताब्यात असलेले पट्टा व इतर किल्ल्यालगतच्या जमीनदारांना रकमा पुरवण्यात आल्या आहेत. ११ जानेवारी १६८८ ला खानाने काही पथके किल्ला घेण्याच्या मार्गावर धाडली. मध्यरात्रीच्या सुमारास किल्ल्याच्या तटाला दोर लावून किल्ला जिंकून घेतला. भगूरचा ठाणेदार गोविंदसिंग याची किल्ल्यावर नेमणूक करण्यात आली. मोगलांनी १६८८ ते ८९ या कालावधीत मराठांचे औंढा, त्रिंबकगड, कवनी, त्रिंगलवाडी, मदनगड, मोरदंत किल्ले फितुरीने घेतले मात्र पट्टागड त्यांना जिंकून घेतला.",
                "गडावर प्रवेश करण्यापूर्वी चार दरवाजे लागतात.पहिल्या दरवाज्याच्या अगोदरच उजवीकडे कातळात वरच्या भागात कोरलेले पाण्याचे टाके लागते.येथेच कातळात कोरलेली हनुमानाची मूर्ती आहे.",
                "गडमाथा तसा विस्तीर्ण आहे. गडमाथा म्हणजे एक पठारच होय. या पठारावर काही तटबंदीचे अवशेष आहेत. ",
                "सन १४८५ मध्ये अहमदनगरच्या निजामशाहीची स्थापना करणार्या मलिक अहमदला पुणे प्रांतातले जे किल्ले मिळाले त्यामधे चावंडचे नाव आहे. बहमनी साम्राज्याचे जे तुकडे झाले त्यात त्याला उत्तर कोकण व पुणे प्रांत मिळाले.\n" +
                        " दुसरा बुर्हाण निजामशाह (इ.स. १५९०-१५९४) हा सातवा निजाम. याचा नातू बहादुरशाह १५९४ साली चावंडला कैदेत होता.\n" +
                        " १६३६ मध्ये निजामशाहीचा आदिलशाह आणि मोगलांपासून बचाव करण्यासाठी शहाजीराजांनी जो तह केला, त्यानुसार चावंड मोगलांना मिळाला.\n" +
                        " मे १६७२ पर्णाल पर्वत ग्रहणाख्यानात कवी जयराम पिंडे म्हणतो की त्याचप्रमाणे चामुंडगड, हरिश्चंद्रगड, महिषगड आणि अडसरगड हे किल्ले महाराजांच्या मावळ्यांनी जिकिरीने लढून घेतले. महाराजांनी याचे नाव प्रसन्नगड असे ठेवले.",
                "इ.स. १५८५ मध्ये मलीक अहमद निजामशाहने हा किल्ला जिंकुन निजामशाहीत आणला. इ.स. १६५७ मध्ये शिवाजी महाराजांनी हा किल्ला जिंकुन परत स्वराज्यात आणला. पुढे ११ जून १६६५ साली झालेल्या इतिहास प्रसिद्ध 'पुरंदरचा तहात' शिवाजी महाराजांनी जयसिंगाला दिलेल्या २३ किल्ल्यांपैकी तिकोना हा एक किल्ला.\n" +
                        "नेताजी पालकर कडे काही दिवस किल्ल्याची जबाबदारी होती.",
                "पायथ्याच्या पाली गावातून इथं येउन किल्ला पाहणे ३-४ तासांत होते. या किल्ल्याच्या पूर्वेला १०-१२ कि.मी. वर सुधागड हा किल्ला आहे. धनगड, कोरीगड, तेलबैल्या, खंडाळा घाट, नागफणी, जांभूळपाडा, अंबा नदी, गरम पाण्याची कुंड असणारे उन्हेरे असा प्रचंड मुलुख या गडावरुन दिसतो. पाली गावात प्रसिद्ध अष्टविनायक क्षेत्र बल्लाळेश्वराचे भव्य मंदिर या सरसगड किल्ल्याच्या पायथ्याशीच आहे.\n" +
                        "इ.स. १३४६ मध्ये सिंहगड, तोरणा, पुरंदर किल्ले जिंकून घेतल्यावर मलिक अहमद ( निजामशाहीचा संस्थापक) कोकणात उतरला. त्या वेळी कोरीगड, सुधागड, सरसगड, सुरगड हे किल्ले त्याच्या ताब्यात आले. नंतर हे किल्ले आदिलशाहीत जमा झाले. शिवशाहीत येताना नारो मुकुंदाना सुधागड, सरसगडाची सबनिशी मिळाली. सुधागडच्या देखभालीसाठी पाच हजार होन आणि सरसगडासाठी दोन हजार होन दिले गेले. पुढे भोर संस्थानात या किल्ल्याची व्यवस्था होती.",
                "",
                "शिवरायांनी स्वराज्याची शपथ घेतली ती याच रायरेश्र्वराच्या डोंगरावर. मात्र ही घटना काल्पनिक आहे की खरी याबद्दल निश्चित विधानमांडता येणार नाही.\n" +
                        "गडावरील पहाण्यासारखी ठिकाणे : रायरेश्र्वरावर पाहण्यासारखे फार काही नाही. रायरेश्र्वराचे पठार हे ५ ते ६ कि.मी. पसरलेले आहे. त्यामुळे या पठारावरील वर्षाऋतुत पाहण्यासारखे असते. रायरेश्र्वरावर शंभुमहादेवाचे मंदिर लक्षात येत नाही. पठारावर अलिकडेच गावं वसलेली आहेत. पठारावर भात शेतीचे प्रमाणही मोठे आहे. पांडवगड, वैराटगड, पाचगणी, महाबळेश्र्वर, कोल्हेश्र्वर, रायगड, लिंगाणा, राजगड, तोरणा, सिंहगड, विचित्रगड, पुरंदर, रुद्रमाळ, चंद्रगड, मंगळगड हा सर्व परिसर येथून दिसतो.",
                "अंजनेरी किल्ला इतिहासात परिचित आहे तो हनुमान जन्मस्थानामुळे. पवनपुत्र हनुमानाचा जन्म याच डोंगरावर अंजनी मातेच्या पोटी झाला म्हणुनच या किल्ल्याला 'अंजनेरी' नाव देण्यात आले. याच डोंगराच्या परिसरात हनुमान लहानाचे मोठे झाले.येथे १०८ जैन लेणी सापडतात.",
                "किल्ल्याच्या पायथ्याशी असणा-या जैन लेण्यांवरून या किल्ल्याची निर्मिती साधारण १०व्या शतकात झाली असावी. हा किल्ला मराठांनी कधी घेतला हे ज्ञात नाही. मात्र १६८८ च्याशेवटी मुघलांनी फितुरीने हा किल्ला मराठांकडून जिंकून घेतला. ",
                "पठाराच्या सर्वात वरच्या भागाला 'दादीमा ताहुली' म्हणतात. येथे ५ पीर आहेत. समोरच एक छोटेसे घर देखील आहे. याच वाटेने थोडे पुढे गेल्यावर दोन तासात आपण ताहुलीच्या सुळक्यापाशी पोहोचतो. एका सुळक्याचे नाव 'दाऊद' तर दुसर्याचे नाव 'बामण' आहे.",
                "इ.स. ११९१-११९२ सालच्या ताम्रलेखानुसार हे किल्ले शिलाहार राजा दुसरा भोज याने बांधले. १६७३ च्या सुमारास शिवरायांनी सातारा प्रांत जिंकला आणि त्याचवेळी सज्जनगड, कल्याणगड, अजिंक्यतारा या किल्ल्यांसोबत यांना देखील स्वराज्यात सामील करून घेतले. पुढे संभाजी राजांच्या कारकिर्दीत सन १६८५ मध्ये फेब्रुवारी महिन्यात अमानुल्ला खानाने चंदन-वंदन येथे असणा-या मराठांच्या तुकडीवर हल्ला केला. या चकमकीत मोघलांच्या हातात २५ घोडी, २० बंदुका, २ निशाणे, १ नगारा सापडला. पुढे १६८९ पर्यंत हा सर्व परिसर मराठांच्या ताब्यात होता. नंतर मात्र तो मोगलांच्या हातात पडला. छत्रपती शाहुमहाराजांनी सन १७०७ मध्ये पावसाळ्यात हा प्रदेश जिंकून घेतला. पुढे सन १७५२ मध्ये ताराबाईवर लक्ष ठेवण्यास पुरेसा फौजफाटा देऊन बाळाजी विश्र्वनाथांनी या किल्ल्यावर दादोपंत यांची नेमणूक केली. नंतर हा किल्ला इंग्रजांच्या\n" +
                        "हातात पडला.",
                "",
                "",
                "राजमाची किल्ल्याच्या पोटात एक लेणं आहे यालाच 'कोंडाणे लेणी' असे म्हणतात.ही लेणी कोंडाणा गावापासून आग्रेयेस २ कि.मी अंतरावर आहेत.ही लेणी ख्रिस्तपूर्व दुस-या शतकात म्हणजे सातवाहनकालाच्या सुरवातीला खोदलेली आहेत.अखंड दगडात कोरलेल्या वास्तुशिल्पाचा हा उत्कृष्ठ नमुना आहे.या लेणी समुहात एक चैत्यगृह आणि सात विहारांचा समावेश आहे. या लेण्यांची निर्मीती राजमाचीवर असणा-या सत्तेखाली झाली.यावरुनच असे अनुमान निघते की हा किल्ला साधारण २५०० वर्षापूर्वीचा असावा.राजमाची किल्ल्यास पूर्वी 'कोंकणचा दरवाजा'संबोधण्यात येत असे. कल्याणच्या १६५७ च्या स्वारी नंतर त्याचवर्षी शिवाजी महाराजांनी पुणे आणि कल्याण विभागात असलेल्या बोरघाटावरील राजमाची ,लोहगड, तुंग, तिकोना, विसापूर किल्ले स्वराज्यात दाखल करून घेतले. यामुळे पुण्यापासून ते ठाण्यापर्यंतचा सर्व प्रदेशावर शिवशाहीचे वर्चस्व प्रस्थापित झाले. पुढे संभाजी महाराज जिवंत असे पर्यंत म्हणजेच सन १६८९ पर्यंत हे सर्व किल्ले मराठयांच्या ताब्यात होते. यानंतर १७१३ मध्ये शाहुमहाराजांनी कान्होजी आंग्रे यांना हा किल्ला दिला . सन १७३० मध्ये हा किल्ला पहिले बाजीराव पेशवे यांच्याकडे आला.१७७६मध्ये सदाशिवरराव तोतयाने संपूर्ण कोकण प्रांत काबीज करीत बोरघाटा पर्यंत पोहचला.त्याने राजमाची किल्ला घेतला.यानंतर या तोतयाचे वर्चस्व वाढले मात्र पेशव्यांनी त्याच्यावर हल्ला करून राजमाची किल्ला आणि आजुबाजुचा परिसर आपल्या ताब्यात घेतला.पुढे १८१८ मध्ये किल्ला इंग्रजांकडे गेला.",
                "महाबळेश्वरहून महाडला जाणारी गाडी कुमरोशी गावाजवळ आली की तेथून अर्ध्या तासाच्या प्रवासात प्रतापगडला जाता येते. गड चढताना त्रास होतोच. ",
                "उत्तर कोकणातील हा किल्ला त्याच्या मुलुखात असलेल्या पनवेल, कल्याण या प्राचीन बंदरांवर नजर ठेवण्यास असावा. किल्ल्यावरील गुहांच्या अभ्यासावरुन त्यांचा कालखंड बौद्ध कालाशी जोडता येतो. त्यांच्यावरील मनुष्य निर्मित गुहांमुळेच उत्तरकालातील शिलाहार, यादव या राज्यकर्त्यांनी त्याला लष्करी चौकी बनवून नाव दिले मुरंजन.बहामनीच्या कालात हा किल्ला आकारास आला असावा. नंतर अहमदनगरच्या निजामशाहीच्या ताब्यात तो आला. निजामशाहीच्या अस्तावेळी शहाजीराजांनी निजामशाहीच्या वारसाला छत्र धरून निजामशाही वाचवण्याचा प्रयत्न केला. पण मोगल शहाजहान आणि विजापूरचा अदिलशहा यांनी तह करून आपल्या संयुक्त फौजा शहाजीराजांच्या मागावर पाठवल्या. तेव्हा शहाजीराजे पळ काढून कोंढाणा व मुरंबदेवाच्या डोंगरात निघून गेले. नंतर कोकणात जंजियाच्या सिद्दिकडे गेले असता त्याने आश्रय नाकारल्यावर चौलला पोर्तुगीजांकडे गेले पण त्यांनीही नकार दिल्यावर शहाजीराजे जिजाऊ, बालशिवाजी आणि लष्करासह मुरंजनावर गेले. सन १६३६ मध्ये बालशिवाजींनी मुरंजनाचा उंबरठा ओलांडला. १६३६ मध्ये माहुलीचा तह झाला. त्यात उत्तर कोकण मोगलांच्या ताब्यात गेले आणि मुरंजनवर मोगली अंमल सुरू झाला. पण प्रत्यक्षात तेथे विजापूरच्या अदिलशहाचीच सत्ता होती. पुढे ही संधी शिवरायांनी साधली. जेव्हा शिवरायांनी जावळीच्या चंद्रराव मोरेला हरवून जावळी ताब्यात घेतली, त्याचवेळी म्हणजे १६५६ मध्ये शिवरायांचा शूर सरदार आबाजी महादेव याने कल्याण भिवंडी पासून चेऊल ते रायरीपर्यंतचा सारा मुलूख स्वराज्यात घेतला. तेव्हा मुरंजन शिवाजी महाराजांच्या ताब्यात आला. किल्ल्याचे नाव बदलून किल्ले प्रबळगड असे ठेवण्यात आले. पुढे १६६५ मध्ये पुरंदरच्या तहानुसार मोगलांना दिलेल्या २३ किल्ल्यांमध्ये प्रबळगड शिवाजी महाराजांनी दिला. जयसिंगाने किल्ल्यावर राजपूत केशरसिंह हाडा हा किल्लेदार नेमला. पुढे पुरंदरचा तह मोडला. मराठे किल्ले परत घेत असतांना मराठांशी झालेल्या लढाईत केशरसिंह धारातीर्थी पडला तत्पूर्वी राजपूत स्त्रियांनी जोहार केला. केशरसिंहाची आई व दोन मुले किल्ल्याच्या झडतीत सापडले.शिवरायांच्या आदेशानुसार त्याने सन्मानाने देऊळगावी मोगल छावणीत पाठवण्यात आले. नंतर किल्ल्यावर खोदकामात बरीच संपत्ती आढळली.",
                "दातेगडास शिवकालात सुंदरगड असेही नाव होते. दातेगडावरील खडकात खोदलेली विहीर व टाकी यावरून हा किल्ला शिवपूर्वकालीन असावा असे वाटते. शिवकालात गडावर कचेरी व कायम शिबंदी होती. या शिबंदीकरता गडाशेजारच्या गावातील जमिनी नेमून देणअयात आल्या होत्या.\n" +
                        "पुढे हा किल्ला काही काळ मोगलांच्या अधिपत्याखाली होता. मे १८१८ मध्ये कॅप्टन ग्रॅट याने हा किल्ला न लढताच जिंकला.\n" +
                        "\n" +
                        "किल्ल्याचे वैशिष्ट्य\n" +
                        "गडाचे क्षेत्रफळ दोन हेक्टर आहे. गडाच्या पश्चिम बाजूस भग्न प्रवेशद्वार आहे.या बाजूस जाण्यासाठी पश्चिम तटाजवळील कातळात खोदलेल्या तीस पायऱ्या आहेत",
                "पुणे, ठाणे आणि अहमदनगर या तीन जिल्ह्यांच्या सीमा जेथे एकत्र येतात तेथून सह्याद्रीची एक उपरांग पूर्वेकडे धावते. ही रांग बालाघाटची रांग म्हणून ओळखली जाते. या भौगोलिकदृष्ट्या अतिशय महत्वाच्या असलेल्या रांगेच्या सुरवातीलाच हरिश्चंद्रगड हा किल्ला आहे.\n" +
                        "\n" +
                        "पौराणिक महत्व\n" +
                        "\n" +
                        "हरिश्चंद्र, तारामती आणि रोहीदास अशी येथील शिखरांची नावे असल्यामुळे या किल्ल्याचा संदर्भ थेट राजा हरिश्चंद्रापर्यंत स्थानिक दंतकथांनी जोडला आहे.",
                "पूर्वी पेणचा उल्लेख तालुका सांकसे, सजा अवचितगड प्रांत कल्याण असाच ऐतिहासिक कागद पत्रातून आढळतो. सांकशी हा किल्ला राणाकंस या राजाने बांधला, त्याची राजधानी होती हेरंबपूर म्हणजेच आजचे हमरापूर. आजही हमरापूर गावात फिरले तर प्राचीन अवशेष आढळतात. राणाकंसच्या काळात सांकसई (बौद्रुद्दीन) किल्ल्यावरुन या सांकसे तालुक्याचा कारभार चाले. त्यावेळी किल्ल्यावर किल्लेदार म्हणून पुंड व पालेगार असत. हे पालेगार एकमेकांवर स्वारी करुन किल्ले ताब्यात घेत. सागर गडच्या पालेगाराने राणासंकच्या साकसईवर स्वारी करून त्याचे राज्य बुडविले.",
                "",
                "किल्ल्याच्या बद्दल इतिहासात फारसा उल्लेख आढळत नाही.मात्र किल्ला कोळी सामंताकडून निजामशहाकडे आणि पुढे आदिलशहाकडे आणि नंतर मराठ्यांकडे आला.",
                "मान आणि महिषी या नद्यांच्या संगमावर असलेल्या छोट्याश्या उंचवट्यावर बाळापूरचा प्रसिद्ध किल्ला बांधलेला आहे. बाळापूरच्या किल्ल्याला दुहेरी बांधणीची भक्कम तटबंदी आहे. या तटबंदीला जागोजाग बलदंड बुरुज बांधून संरक्षणाची सिद्धता केलेली आहे.\n" +
                        "बाळापूर किल्ल्याचा प्रवेशमार्ग उत्तरेकडून आहे. या प्रवेशमार्गावर तीन दरवाजे आहेत. पहिला दरवाजा चौरस अशा भक्कम बुरुजामध्ये आहे. या उत्तराभिमुख दरवाजातून आत गेल्यावर दुसरा दरवाजा असून तो पश्चिमेकडे तोंड करुन आहे. याचे लाकडी दरवाजे अजूनही पहायला मिळतात. दारावरच्या कमानीवर महीरप आहे. या दरवाजातून आत शिरल्यावर दोन्ही बाजूला तटबंदी असून समोर उत्तराभिमुख तिसरा दरवाजा आहे. यालाही महीरप केलेले आहे.",
                "इतर अनेक किल्ल्यांप्रमाणे याही किल्ल्याची मूळ उभारणी कोणी केली, हे ज्ञात नाही. पण १४८५ च्या सुमारास हे ठिकाण नगरच्या निजाम शाहीच्या संस्थापक असलेल्या मलिक अहमद याच्याकडे आले. पुढे शहाजीराजे निजामशाहीचे संचालक बनल्यावर दिल्लीच्या मोगल फौजा व आदिलशाही सेना संयुक्तपणे निजामशाही बुडवण्यासाठी प्रयत्न करू लागल्या. १६३५-३६ च्या सुमारास शहाजींनी कठीण परिस्थितीत बळकट आश्रयस्थान म्हणून जुन्नर - शिवनेरीहून जिजाबाई व बाळ शिवाजीसह माहुलीला मुक्काम हलवला. खानजमान म्हणजे महाबतखानाच्या मुलाने माहुलीला वेढा दिला. शहाजीराजांनी पोर्तुगीजांकडे मदत मागितली. पण त्यांनी नकार दिला असता शहाजींनी शरणागती पत्करली. पुढे १६५८ मध्ये ८ जानेवारी रोजी शिवरायांनी हा किल्ला मोगलांकडून परत मिळवला. पण १६६१ मध्ये तो मोगलांना परत ावा लागला.\n" +
                        "लगेसच तो परत जिंकून घेतला गेला. १६६५ च्या पुरंदरच्या तहात हे दुर्गत्रिकुट परत गमवावे लागले. त्यानंतर मोगलांचा मनोहरदास गौड हा धोरणी कर्तबदार सरदार माहुलीवर कारभार पाहू लागला. त्याने गडावर बरेच बांधकाम करून घेतले. फेब्रुवारी १६७० मध्ये खुद्द शिवाजीराजांच्या नेतृत्त्वाखाली माहुलीवर केलेला हल्ला अयशस्वी ठरला. दीड हजार मराठी मावळ्यांपैकी तब्बल हजार मावळे मोगलांनी कापून काढले. मराठांचा दणदणीत पराभव झाला. या यशानंतरही मनोहरदास गौडने किल्लेदारी सोडली. त्याच्या जागी अलाविर्दी बेग हा नवा किल्लेदार रुजू झाला. नंतर १६ जून १६७० रोजी दोन महिन्यांच्या वेढा नंतर दोनशे मोगल सैनिकांचे रक्त सांडले. मोरोपंत पिंगळ्यांनी माहुली, पळसगड व भंडारगड हे त्रिकूट स्वराज्यात सामील करून घेतले.",
                "जीर्णनगर, जुन्नेर म्हणजेच जुन्नर हे शहर इसवीसनापूर्व काळापासून प्रसिद्ध आहे. जुन्नर ही शकराजा नहपानाची राजधानी होती. सातवाहन राजा गौतमीपुत्र सातकर्णी याने शकांचा नाश केला आणि जुन्नर व येथील सर्व परिसरावर आपले वर्चस्व प्रस्थापित केले. नाणेघाट हा पुरातन व्यापारी मार्ग. या मार्गावरून फार मोठा प्रमाणावर वाहतूक चालत असे. यावर नजर ठेवण्यासाठी या मार्गावरील दुर्गांची निर्मीती करण्यात आली. सातवाहनांची सत्ता स्थिरावल्यानंतर येथे अनेक ठिकाणी त्यांनी लेणी खोदवून घेतली. सातवाहनांनंतर शिवनेरी चालुक्य, राष्ट्रकूट या राजवटींच्या सत्तेखाली होता. ११७० ते १३०८ च्या सुमारास यादवांनी येथे आपले राज्य स्थापन केले. आणि याच काळात शिवनेरीला गडाचे स्वरूप प्राप्त झाले. नंतर इ. स. १४४३ मध्ये मलिक उल तुजार याने यादवांचा पराभव करून किल्ला सर केला. अशा प्रकारे किल्ला बहमनी राजवटीखाली आला. इ. स. १४७० मध्ये मलिक उल तुजारचा प्रतिनिधी मलिक महंमद याने किल्ला नाकेबंदी करून पुन्हा सर केला. १४४६ मध्ये मलिक महंमदच्या वडिलांच्या मृत्युनंतर निजामशाहीची स्थापना झाली. \n",
                "यादवांनी बांधलेल्या देवगिरी किल्ल्यासारखा संपूर्ण महाराष्ट्रात किल्ला नाही. महम्मद तुघलकने या देवगिरीचे दौलताबाद नाव केले. १५२६ पर्यंत इथे बहामनी सत्ता होती. त्यानंतर औरंगजेबच्या मृत्यूपर्यंत (१७०७) हा किल्ला मुघलांकडे होता. सुमारे २०० मी. उंचीवर हा किल्ला आहे. किल्ल्याला ७ वेशी असून २ कि.मी. लांबीचा अभेद्य तट आहे. किल्ल्यावर एक उंच स्तंभ आहे, त्याचबरोबर हत्ती हौद, भारतमातेचे मंदिर, चिनी महाल, मीठ अंधेरी मार्ग, खंदक इ अनेक ऐतिहासिक वास्तू या किल्ल्यात आहेत. दिल्लीच्या कुतुबमिनारची आठवण करून देणारा निरीक्षणासाठीचा मनोरा हे एक वैशिष्ट्य येथे बघता येते. संत एकनाथ यांचे गुरू जनार्दन स्वामी यांची समाधी याच किल्ल्यावर आहे. या किल्ल्याचे वैशिष्ट्य म्हणजे एवढ्या वर्षात कोणाही स्वारी करणार्या राजाला तो लढून जिंकता आला नाही. ",
                "गड हा तीन भागात विभागला आहे.पहिल्या टप्प्यावर सरंक्षक तटबंदी तर दुस-या टप्प्यावर माचीचा भाग आणि सर्वात वरचा बालेकिल्लाचा भाग आहे.",
                "थाळनेर म्हणजे थळ + निर या शब्दांची संधी आहे. थळ म्हणजे जमीन आणि निर म्हणजे पाणी. जेथे समृद्ध जमीन आहे आणि मुबलक पाणी आहे असे थाळनेर.\n" +
                        "\n" +
                        "थाळनेर बद्दल एक दंतकथाही प्रसिद्ध आहे. मलिकरवान हा लष्करी सेवेतील एक सैनिक होता. ता काही कारणाने या परिसरामध्ये आला असताना त्याने येथे एक विचित्र दृष्य पाहील. तो गावात पोहोचला असताना त्याला एक कुत्रा एका सश्याच्या मागे धावताना दिसला. कुत्रा सशाचा पाठलाग करीत असताना पुढे धावणारा ससा अचानक थांबला आणि त्याने कुत्र्यावर आक्रमण केले. सशाच्या या पावित्र्याने कुत्रा माघारी पळू लागला आणि ससा त्याचा पाठलाग करु लागला. असे अनोखे दृष्य पाहून मलिकखान एकदम चकीत झाला. त्याने विचार केला की 'ज्या भूमीमध्ये ससा कुत्र्याला पळवू शकतो ती भूमी निश्चीतपणे शौर्याची भूमी असली पाहीजे.' या भूमीमध्ये जर आपण वास्तव्य केले तर निश्चितच आपल्या हातून पराक्रम घडेल व आपल्याला उर्जितावस्था प्राप्त होईल. म्हणून मलिकखान याने तेथील वतनदाराला ही घटना सांगून तेथे रहाण्याची परवानगी मागितली. वतनदाराने या गोष्टीला नकार दिला. मलिकखान तडक दिल्लीला गेला. दिल्लीमध्ये त्यावेळी सुलतान घराण्याची सत्ता होती. फिरोजशहा तुघलग हा त्यावेळी सुलतान होता.",
                "शिवजन्माच्या वेळी अस्ताला जाणार्या निजामशाहीच्या देणारा किल्ला म्हणजे जीवधन होय. १७ जुन १६६३ रोजी निजामशाही बुडाली. शहाजीराजांनी निजामशाहीचा शेवटचा वंशज मुर्तिजा निजाम याला जीवधनच्या कैदेतून सोडवुन संगमनेरजवळील पेमगिरी किल्ल्यावर त्याला निजामशहा म्हणुन घोषित केले व स्वतः वजीर बनले.\n" +
                        "गडाचा दरवाजा हा कातळकड्यामध्ये कोरलेला आहे.",
                "खरे तर रायगड जिल्ह्याचे दुर्गभूषण शोभणारा हा किल्ला असूनही तसे नाव घेण्याजोगे इथ काही घडले नाही. किल्ल्यावरील गुहेच्या अलीकडे एक पडक्या अवस्थेतील शेष तटबंदी दिसते. किल्लेपणाची हीच काय ती खूण. मे १६५६ मध्ये शिवरायांनी कल्याणभिवंडी-रायरी पर्यंतचा सारा मुलूख घेतला, तेव्हा त्यात हा गडही मराठांच्या ताब्यात आला असावा. अल्प विस्तार,पाण्याची कमी साठवणूक, बांधकामाचा अभाव, मर्यादित लोकांची मुक्कामाची सोय, अतिशय अवघड वाट हे सारे पाहून हा किल्ला नसून, एक लष्करी चौकी असावी असेच वाटते. काही जणांच्या मते ७ ऑक्टोबर १९५७ रोजी चंदेरी किल्ल्याच्या सुळक्यावर संघटित प्रस्तरारोहणाचा प्रारंभ झाला\n",
                "रामटेकच्या प्रसिद्ध अशा धार्मिक व पर्यटन स्थळाच्या जवळ असूनही नगरधनचा किल्ला मात्र अनेकांना अपरिचित आहे. रामटेकच्या डोंगरावरुन नगरधनचा किल्ला ओळखू येतो.",
                "रोह्यापासून समुद्र अगदी जवळच आहे.कुंडलिका नदी जिथे सागराला मिळते तो सर्व भाग पूर्वी सागरी वाहतुकीसाठी वापरला जात असे.या सर्व परिसरावर नजर ठेवण्यासाठी अनेक किल्ले बांधले गेले त्यापैकी एक म्हणजे तळगङशिवरायांनी या सर्व परिसराचे महत्व जाणले होते म्हणूनच तळगड आणि घोसाळगड हे किल्ले आपल्या ताब्यात घेतले.पुढे राजा जयसिंगाशी झालेल्या पुरंधर किल्ल्याच्या तहामध्ये महाराजांनी १२ किल्ले स्वतःकडे ठेवले.त्यामध्ये तळगड हा एक होता.यावरूनच या किल्ल्याचे महत्व आपणास समजते.पुढे १८१८ मध्ये जनरल प्राथरने हा किल्ला जिंकला.",
                "",
                "खरे पहिले तर काळदुर्गला गड म्हणने योग्य नाही, कारण गड असल्याची कोणतीही खुण यावर नाही. हे एक टेहाळणीचे स्थान असावे असे वाटते.",
                "नळदुर्ग किल्ला हा उस्मानाबाद जिल्ह्यामध्ये तुळजापूर तालुक्यात आहे. पुणे - हैद्राबाद या राष्ट्रीय महामार्गावर नळदुर्ग आहे. सोलापूरकडून हैद्राबादकडे निघाल्यावर सोलापूर पासून ५० कि.मी. अंतरावर नळदुर्ग गाव आहे. या गावातच नळदुर्ग हा अप्रतिम बांधकामाचा हा अजोड किल्ला आहे.\n" +
                        "स्थानिक लोक नळदुर्गाचा इतिहास नळराजा व दमयंती राणी पर्यंत नेऊन पोहोचवितात. हा किल्ला कल्याणीच्या चालुक्य राजाच्या ताब्यात होता. पुढे तो बहमनी सुलतानांच्या ताब्यामध्ये होता. बहमनी राज्याची शकले उडाली व त्यातुन ज्या शाह्या निर्माण झाल्या त्यामधील विजापूरच्या आदिलशहीने नळदुर्गावर कब्जा मिळवला. पुढे औरंगजेब या मोगल बादशहाने नळदुर्ग जिंकला आणि त्याची जबाबदारी हैद्राबादच्या निजामाकडे सोपवली.\n",
                "या किल्ल्याचे मूळ नाव पेब हे नाव पायथ्याच्या असलेल्या पेबी देवीवरून पडले असावे. किल्ल्यावरील गुहेचा शिवाजी महाराजांनी धान्य कोठारांसाठी उपयोग केला होता, असा स्पष्ट ऐतिहासिक संदर्भ पेबच्या किल्ल्याबाबत आढळतो.गडावरील पहाण्यासारखी ठिकाणे : पेबचा किल्ला चढताना वाटेत लागणारा धबधबा हे एक मोठे आकर्षण. किल्ल्यावरील गुहेसमोरून पावसाळ्यात सुंदर देखावा दिसतो. गुहे समोरून आपल्याला नवरा-नवरी,भटोबा असे सुळके दिसतात.",
                "",
                "सह्याद्रीच्या मुख्य रांगेवर असलेला हरिश्चंद्रगड समुद्र सपाटीपासून १४२४ मीटर उंच आहे. गडावर जाण्यासाठी तीन चार वाटा सध्या प्रचलित आहेत. त्यापैकी पाचनई कडील वाट आणि खिरेश्वरकडून जाणारी वाट दुर्गप्रेमी मंडळींना सोयीची आहे. मोठ्या प्रमाणावर खिरेश्वरकडूनच राबता जास्त आहे.\n" +
                        "कल्याण -अहमदनगर असा राजरस्ता माळशेज घाटातून जातो. या घाटाच्या माथ्यावर खुबीफाटा आहे. या खुबीफाट्यावरुन खिरेश्वरला जाता येते. तसेच पुण्याकडून खिरेश्वरपर्यंत एस.टी. बसेसचीही सोय आहे. खुबीफाट्यावरून खिरेश्वरकडे निघाल्यावर वाटेत आश्रमशाळा आहे. अडचणीच्या वेळेस येथे विनंतीवरून मुक्कामाची सोय होवू शकते. याच वाटेच्या बाजूला प्राचीन मंदिरही आहे.\n" +
                        "हरिश्चंद्रगडाचा माथा अतिशय विस्तीर्ण असल्यामुळे तो खालून एकदम भव्य दिसतो. त्याच्या पुर्व बाजूला इंग्रजी यु आकाराची खिंड होय. ही खिंड म्हणजे प्रसिद्ध टोलार खिंड होय. ही खिंड पुणे आणि नगर जिल्ह्यांमधील दुवा आहे. ",


        };

        try {
            fortAdapter = new Fort_Adapter(FortInformation.this, fortImg, fortName, fortIntroduction, fortHistory);
            recyclerView.setAdapter(fortAdapter);
            fortAdapter.notifyDataSetChanged();
        } catch (Exception e) {
            e.printStackTrace();
        }

    }

    @Override
    public void onBackPressed() {
        //super.onBackPressed();

        try {
            AlertDialog.Builder builder = new AlertDialog.Builder(this);
            builder.setMessage("Are you sure you want to exit?")
                    .setCancelable(false)
                    .setPositiveButton("Yes", new DialogInterface.OnClickListener() {
                        public void onClick(DialogInterface dialog, int id) {

                            Intent intent = new Intent(Intent.ACTION_MAIN);
                            intent.addCategory(Intent.CATEGORY_HOME);
                            intent.setFlags(Intent.FLAG_ACTIVITY_NEW_TASK);
                            startActivity(intent);
                        }
                    })
                    .setNegativeButton("No", new DialogInterface.OnClickListener() {
                        public void onClick(DialogInterface dialog, int id) {
                            dialog.cancel();
                        }
                    });
            AlertDialog alert = builder.create();
            alert.show();
        } catch (Exception e) {
            e.printStackTrace();
        }

    }


}
